{
  "Albedo": {
    "talent_priority": [
      "Elemental skill",
      "Elemental Burst",
      "Normal Attack"
    ],
    "elemental_skill": "Albedo creates a Solar Isotoma using alchemy, dealing AoE Geo DMG. At specific intervals, hits on enemies within the Solar Isotoma field will cause the Solar Isotoma to generate Transient Blossoms which deal AoE Geo DMG to the enemy based on Albedo's DEF. Only one Solar Isotoma can exist at any given time, and the Solar Isotoma is considered a Geo Construct.When a character stands at the locus of the Solar Isotoma, it will gather the power of Geo to form a crystallized platform that lifts the character up to a certain height. Only one platform can exist at a time.",
    "elemental_burst": "Crystaliized Geo energy bursts forth at Albedo's command, dealing AoE Geo DMG in front of Albedo. If a Solar Isotoma created by Albedo himself is on the field, 7 Fatal Blossoms will be generated in the Solar Isotoma field, bursting violently into bloom and dealing AoE Geo DMG. (Tectonic Tide DMG and Fatal Blossom DMG will not generate Transient Blossoms.)",
    "passive_talent_1": "Transient Blossoms generated by Abiogenesis: Solar Isotoma deal 25% more DMG to opponents whose HP is below 50%.",
    "passive_talent_2": "Using Rite of Progeniture: Tectonic Tide increases the Elemental Mastery of nearby party members by 125 for 10s."
  },
  "Alhaitham": {
    "talent_priority": [
      "Elemental skill",
      "Normal Attack",
      "Elemental Burst"
    ],
    "best_artifact_set": {
      "name": "Gilded Dreams",
      "piece_bonus": "4pc",
      "description": "Within 8s of triggering an Elemental Reaction, the character equipping this will obtain buffs based on the Elemental Type of the other party members. ATK is increased by 14% for each member whose Elemental Type is the same as the equipping character, and EM is increased by 50 for every member with a different Elemental Type. Each of the buffs will count up to 3 characters. This effect can be triggered once every 8s and even when not on the field."
    },
    "elemental_skill": "When this skill is unleashed, Alhaitham will generate 1 Chisel-Light Mirror. If there are no Mirrors at this time, he will generate 1 additional Mirror. Chisel-Light Mirrors will have the following properties: • When attacks of the aforementioned kind hit opponents, the Chisel-Light Mirrors will unleash a Projection Attack that deals AoE Dendro DMG based on the number of Mirrors on the field. • A total of 3 Chisel-Light Mirrors can exist at once. The Chisel-Light Mirrors will disappear one after the other over time, and will all disappear when Alhaitham leaves the field.",
    "elemental_burst": "Creates a Particular Binding Field and deals multiple instances of AoE Dendro DMG. If Chisel-Light Mirrors exist when this ability is unleashed, all such Mirrors will be consumed and increase the number of DMG instances dealt. 2s after this ability is unleashed, if 0/1/2/3 Mirrors were consumed, Alhaitham will generate 3/2/1/0 new Mirrors in turn.",
    "passive_talent_1": "When Alhaitham's Charged or Plunging Attacks hit opponents, they will generate 1 Chisel-Light Mirror. This effect can be triggered once every 12s.",
    "passive_talent_2": "Each point of Alhaitham's Elemental Mastery will increase the DMG dealt by Projection Attacks and Particular Field: Fetters of Phenomena by 0.1%. The DMG of both aforementioned abilities can be increased by a maximum of 100% this way."
  },
  "Aloy": {
    "talent_priority": [
      "Elemental Burst",
      "Elemental skill",
      "Normal attack"
    ],
    "elemental_skill": "Aloy throws a Freeze Bomb that explodes on impact. The Freeze Bomb then splits up into Chillwater Bomblets that explode upon contact with enemies after a short delay. Both bomb types deal Cryo DMG. When either bomb type hits an enemy, the opponent's attack is reduced and Aloy gets 1 Coil stack. Aloy can gain up to 1 Coil Stack every 0.1s. ________________ Coil ・Each stack increases Aloy's Normal ATK DMG. ・ At 4 stacks, all stacks are cleared. Aloy then enters the Rushing Ice state, which further increases her Normal ATK DMG and converts her Normal ATKs to Cryo DMG. ・While in this state, Aloy can't obtain new stacks. Coil effects will be cleared 30s after Aloy leaves the field.",
    "elemental_burst": "Aloy throws a Power Cell filled with Cryo at a targeted direction, then detonates it with an arrow, dealing AoE Cryo DMG.",
    "passive_talent_1": "When Aloy gains a Coil stack from Frozen Wilds, her ATK is increased by 16%, while nearby party members' ATK is increased by 8%. This effect lasts 10s.",
    "passive_talent_2": "When Aloy is in the Rushing Ice state conferred by Frozen Wilds, her Cryo DMG Bonus increases by 3.5% every 1s. A maximum Cryo DMG Bonus increase of 35% can be gained in this way."
  },
  "Amber": {
    "talent_priority": [
      "Elemental burst",
      "Elemental skill",
      "normal attack"
    ],
    "elemental_skill": "Hold Attack: Adjusts the throwing direction of Baron Bunny. The longer the button is held, the further the throw. ________________ Baron Bunny ・Continuously taunts the enemy, drawing their fire. ・Baron Bunny's HP scales with Amber's Max HP. ・When destroyed or when its timer expires, Baron Bunny explodes, dealing AoE Pyro DMG.",
    "elemental_burst": "Fires off a shower of arrows, dealing continuous AoE Pyro DMG.",
    "passive_talent_1": "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%.",
    "passive_talent_2": "Aimed Shot hits on weak spots increase ATK by 15% for 10s."
  },
  "Arlecchino": {
    "best_artifact_set": {
      "name": "Fragment of Harmonic Whimsy",
      "piece_bonus": "",
      "description": ""
    },
    "talent_priority": [
      "Normal attack",
      "elemental skill",
      "elemental burst"
    ],
    "elemental_skill": "Summons forth Balemoon Bloodfire, dealing Pyro DMG to multiple nearby opponents and performing a dash-cleave against one of them, dealing AoE Pyro DMG. Opponents hit by the aforementioned attack will have a Blood-Debt Directive applied to them. Blood-Debt Directive Lasts 30s. Every 5s, it will deal 1 instance of Pyro DMG to the opponent. Max 2 instances. This DMG will be considered Elemental Skill DMG. When Arlecchino uses a Charged Attack or her Elemental Burst, Balemoon Rising, she will absorb and clear nearby Blood-Debt Directives. Each Directive absorbed grants her a Bond of Life worth 65% of her Max HP. The maximum value of the Bond of Life she can be granted through Blood-Debt Directives within 35s after using her Elemental Skill is 145% of her Max HP. Using the Elemental Skill again during this duration will restart the count on duration and the limit on the value of Bond of Life she may gain from Blood-Debt Directives.",
    "elemental_burst": "Arlecchino's great wing of Balemoon Bloodfire beats as she absorbs and clears Blood-Debt Directives around her. She deals AoE Pyro DMG before clearing the CD of All Is Ash and healing herself. The healing is based on her Bond of Life value and ATK.",
    "passive_talent_1": "Blood-Debt Directives: ·Arlecchino will be granted a Bond of Life worth 130% of her Max HP when an opponent to which she herself applied a Directive is defeated. ·5s after a Directive is applied, it will be upgraded to a Blood-Debt Due. When absorbed, it will instead grant Arlecchino a Bond of Life worth 130%. A Bond of Life created in the aforementioned ways cannot exceed the original limit on the value of Bonds of Life obtained through All Is Ash.",
    "passive_talent_2": "Alecchino gains 1% All Elemental and Physical RES for every 100 ATK she has in excess of 1,000. The maximum RES increase she can gain this way is 20% Passive talent 3: While in combat, Arlecchino gains a 40% Pyro DMG Bonus and can only be healed through Balemoon Rising"
  },
  "Kamisato-Ayaka": {
    "talent_priority": [
      "Elemental burst",
      "normal attack",
      "elemental skill"
    ],
    "elemental_skill": "Summons blooming ice to launch nearby opponents, dealing AoE Cryo DMG.",
    "elemental_burst": "Summons forth a snowstorm with flawless poise, unleashing a Frostflake Seki no To that moves forward continuously. ________________ Frostflake Seki no To ・A storm of whirling icy winds that slashes repeatedly at every enemy it touches, dealing Cryo DMG. ・The snowstorm explodes after its duration ends, dealing AoE Cryo DMG. ________________",
    "passive_talent_1": "After using Kamisato Art: Hyouka, Kamisato Ayaka's Normal and Charged Attacks deal increased DMG for 6s.",
    "passive_talent_2": "When the Cryo application at the end of Kamisato Art: Senho hits an opponent, Kamisato Ayaka gains the following effects: • Restores 10 Stamina • Gains 18% Cryo DMG Bonus for 10s."
  },
  "Kamisato-Ayato": {
    "talent_priority": [
      "if main DPS",
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "echoes of an offering",
      "piece_bonus": "4pc) When Normal Attacks hit opponents, there is a 36% chance that it will trigger Valley Rite, which will increase Normal Attack DMG by 70% of ATK. This effect will be dispelled 0.05s after a Normal Attack deals DMG. If a Normal Attack fails to trigger Valley Rite, the odds of it triggering the next time will increase by 20%. This trigger can occur once every 0.2s.",
      "description": ""
    },
    "elemental_skill": "Kamisato Ayato shifts positions and enters the Takimeguri Kanka state. After this shift, he will leave a watery illusion at his original location. After it is formed, the watery illusion will explode if opponents are nearby or after its duration ends, dealing AoE Hydro DMG. ________________ Takimeguri Kanka In this state, Ayato uses his Shunsuiken to engage in blindingly fast attacks, causing DMG from his Normal Attacks to be converted into AoE Hydro DMG. This cannot be overridden. It also has the following properties: ・After a Shunsuiken hits an enemy, it will grant Namisen, which increases the DMG based on Ayato's Max HP. The initial maximum no. of Namisen stacks is 4, and 1 stack can be gained via Shunsuiken every 0.1s. ・Kamisato Ayato's RES to interruption is increased. ・Unable to use Charged or Plunging Attacks. Takimeguri Kanka will be cleared when Ayato leaves the field. Using Kamisato Art: Kyouka again while in this state will reset and replace the pre-existing one.",
    "elemental_burst": "Unveils a garden of purity that silences the cacophony within. While this space exists, Bloomwater Blades will constantly rain down and attack opponents within its AoE, dealing Hydro DMG and increasing the Normal Attack DMG of characters within.",
    "passive_talent_1": "Ayato's Elemental Skill has the following properties: ・After it is used, Kamisato Ayato will gain 2 Namisen stacks. ・When the water illusion explodes, Ayato will gain a Namisen effect equal to the maximum number of stacks possible.",
    "passive_talent_2": "If Ayato is not on the field and his energy is low, he will regenerate a set amount of energy in regular intervals."
  },
  "Baizhu": {
    "talent_priority": [
      "Elemental skill and burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "deepwood memories",
      "piece_bonus": "4pc) After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field.",
      "description": ""
    },
    "elemental_skill": "Controls a Gossamer Sprite that cruises and attacks nearby opponents, dealing Dendro DMG. ________________ After it performs 3 attacks or if there are no opponents nearby, the Sprite will return, healing all nearby party members based on Baizhu's Max HP.",
    "elemental_burst": "Enters the Pulsing Clarity state, creating a Seamless Shield that absorbs Dendro DMG with 250% effectiveness. The Seamless Shield will heal your own active character based on Baizhu's Max HP and attack opponents by unleashing Spiritveins, dealing Dendro DMG under the following circumstances: - When a character is under the protection of a Seamless Shield and a new Seamless Shield is generated. - When the Seamless Shield's effects expire, or when it is shattered.",
    "passive_talent_1": "Enters the Pulsing Clarity state, creating a Seamless Shield that absorbs Dendro DMG with 250% effectiveness. The Seamless Shield will heal your own active character based on Baizhu's Max HP and attack opponents by unleashing Spiritveins, dealing Dendro DMG under the following circumstances: - When a character is under the protection of a Seamless Shield and a new Seamless Shield is generated. - When the Seamless Shield's effects expire, or when it is shattered.",
    "passive_talent_2": "Characters who are healed by Seamless Shields will gain the Year of Verdant Favor effect: Each 1,000 Max HP that Baizhu possesses that does not exceed 50,000 will increase the Burning, Bloom, Hyperbloom, and Burgeon reaction DMG dealt by these characters by 2%, while the Aggravate and Spread reaction DMG dealt by these characters will be increased by 0.8%. This effect lasts 6s."
  },
  "Barbara": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attacks"
    ],
    "elemental_skill": "Summons water droplets resembling musical notes that form a Melody Loop, dealing Hydro DMG to surrounding enemies and afflicting them with the Wet status. ________________ Melody Loop ・Barbara's Normal Attacks heal your characters in the party and nearby allied characters for a certain amount of HP, which scales with Barbara's Max HP. ・Her Charged Attacks generates 4 times the amount of healing. ・Regenerates a certain amount of HP at regular intervals for your active character. ・Applies the Wet status to the character and enemies who come in contact with them.",
    "elemental_burst": "Heals nearby allied characters and your characters in the party for a large amount of HP that scales with Barbara's Max HP.",
    "passive_talent_1": "The Stamina Consumption of characters within Let the Show Begin's Melody Loop is reduced by 12%.",
    "passive_talent_2": "When your active character gains an Elemental Orb/Particle, the duration of Let the Show Begin's Melody Loop is extended by 1s. The maximum extension is 5s."
  },
  "Beidou": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": " Accumulating the power of lightning, Beidou swings her blade forward fiercely, dealing Electro DMG. ________________ Hold Attack: Lifts her weapon up as a shield. Max DMG absorbed scales off Beidou's Max HP. Attacks using the energy stored within the greatsword upon release or once this ability's duration expires, dealing Electro DMG. DMG dealt scales with the number of times Beidou is attacked in the skill's duration. The greatest DMG Bonus will be attained once this effect is triggered twice. The shield possesses the following properties: ・Has 250% Electro DMG Absorption Efficiency. ・Applies the Electro element to Beidou upon activation.",
    "elemental_burst": " ・When Normal and Charged Attacks hit, they create a lightning discharge that can jump between enemies, dealing Electro DMG. ・Increases the character's resistance to interruption, and decreases DMG taken. A maximum of 1 lightning discharge can be triggered per second.",
    "passive_talent_1": "Counterattacking with Tidecaller at the precise moment when the character is hit grants the maximum DMG Bonus.",
    "passive_talent_2": "Gain the following effects for 10s after unleashing Tidecaller with its maximum DMG Bonus: ・DMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%. ・Greatly reduced delay before unleashing Charged Attacks."
  },
  "Bennett": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Noblesse Oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Tap A single, swift flame strike that deals Pyro DMG. ________________ Hold Attack: (Short) Charges up, resulting in different effects when unleashed based on the Charge Level. ・Level 1: Strikes twice, dealing Pyro DMG and launching enemies. ・Level 2: Unleashes 3 consecutive attacks that deal impressive Pyro DMG, but the last attack triggers and explosion that launches both Bennett and the enemy.",
    "elemental_burst": "Bennett performs a jumping attack that deals Pyro DMG, creating an Inspiration Field. ________________ Inspiration Field ・If the health of a character in the circle is equal to or falls below 70%, their health will continuously regenerate. Regeneration scales based on Bennett's Max HP. ・If the health of a character in the circle is higher than 70%, they gain an ATK Bonus that is based on Bennett's Base ATK. ・Applies the Pyro element to characters within the Field.",
    "passive_talent_1": "Decreases Passion Overload's CD by 20%.",
    "passive_talent_2": "Within the area created by Fantastic Voyage, Passion Overload takes on the following effects: ・CD is reduced by 50%. ・Bennett will not be launched by the effects of Charge Level 2."
  },
  "Candace": {
    "talent_priority": [
      "Normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": "Candace's Elemental Skill, Sacred Rite: Heroes Sanctum, allows her to block incoming damage with her shield while charging. Once charged up, she will strike with her Polearm and deal Hydro DMG. After unlocking the Aegis of Crossed Arrows talent, the shield will instantly be fully charged when an enemy attacks her while holding the stance.",
    "elemental_burst": "Candace's Elemental Burst, Sacred Rite: Wagtail's Tide, deals AoE Hydro DMG to enemies and provides the Prayer of the Crimson Crown buff to the entire party.When swapping to different characters under the Pyarer of the Crimson Crown effect, an AoE around the player will trigger, dealing Hydro damage. In addition, Sword, Claymore, and Polearm characters buffed by the Prayer of the Crimson Crown will have their weapons infused with the Hydro Element. All characters will also increase their Elemental DMG from their Normal Attack.",
    "passive_talent_1": "If Candace is hit by an attack in the Hold duration of Sacred Rite: Heron's Sanctum, that skill will finish charging instantly.",
    "passive_talent_2": "Characters affected by the Prayer of the Crimson Crown caused by Sacred Rite: Wagtail's Tide will deal 0.5% increased DMG to opponents for every 1,000 points of Candace's Max HP when they deal Elemental DMG with their Normal Attacks."
  },
  "Charlotte": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Golden troupe",
      "piece_bonus": "4pc) Increases Elemental Skill DMG by 25%. Additionally when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field.",
      "description": ""
    },
    "elemental_skill": " Framing: Freezing Point Composition Tap: Takes a snapshot using Monsieur Verite, dealing AoE Cryo DMG to opponents in front of her and applying Snappy Silhouette to a maximum of 5 opponents. During this effect's duration, it will deal Cryo DMG to affected opponents at intervals. ________________ Hold: Charlotte enters Composition Mode, and during this time, the viewfinder will expand as you hold until you reach a Finisher Frame state. When the hold state ends, Monsieur Verite will deal Cryo DMG to all opponents locked on within the viewfinder, and apply the same Snappy Silhouette as Tap Mode does to them. Composition Mode lasts a maximum of 15s and allows a maximum of 5 opponents to be selected.",
    "elemental_burst": " Still Photo: Comprehensive Confirmation Condensing ice to create The Steambird's signature, Charlotte creates a Newsflash Field that will deal AoE Cryo DMG and restores HP for all nearby party members based on Charlotte's ATK. ________________ Newsflash Field: While the ability is active, Monsieur Verite will deal Cryo DMG at intervals to opponents within its AoE. Will continuously restore HP to active character(s) within its AoE based on Charlotte's ATK.",
    "passive_talent_1": "When opponents marked by \"Focused Impression\" are defeated, Framing: Freezing Point Composition's CD will be decreased by 2s. This CD decrease can be triggered 4 times every 12s.",
    "passive_talent_2": "When the party contains 1/2/3 Fontainians other than herself, Charlotte gains a 5%/10%/15% Healing Bonus. When the party contains 1/2/3 non-Fontainians, Charlotte gains a 5%/10%/15% Cryo DMG Bonus."
  },
  "Chasca": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Obsidian codex",
      "piece_bonus": "4pc) After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.",
      "description": ""
    },
    "elemental_skill": " Spirit Reins, Shadow Hunt After using her Elemental Skill, Chasca will immediately deal Nightsoul-aligned AoE Anemo DMG to nearby opponents, and mount “Soulsniper: Ritual Staff” to enter the Nightsoul's Blessing state. ___ When Chasca is in the Nightsoul's Blessing state, tap the Normal Attack button to deal Nightsoul-aligned Anemo DMG. This DMG is considered Normal Attack DMG. When Chasca is in the Nightsoul's Blessing state, hold the Normal Attack button to enter aiming mode and load up to 6 “Shadowhunt Shells.” When 6 Shells have been loaded or charging is stopped, these Shells will be fired at the chosen opponents in sequence. This DMG (caused by the elemental shells)  is Chasca's main source of DMG.",
    "elemental_burst": " Soul Reaper's Fatal Round Chasca's Elemental Burst fires a \"Galesplitting Soulseeker Shell\" that deals Nightsoul-aligned AoE Anemo Damage to enemies. The single Shell will then split into 6 \"Soulseeker Shells\", attacking nearby enemies. ________________ \"Soulseeker Shells\" will undergo Elemental Conversion based on the Elemental Types of your party members, dealing Nightsoul-aligned DMG of the corresponding Elemental Type.",
    "passive_talent_1": "When the Elemental Skill Spirit Reins, Shadow Hunt's Multitarget Fire is being charged, if there are party members who meet the Elemental Conversion Type requirements, the following effects will be gained, based on the number of different eligible Elemental Types present:",
    "passive_talent_2": "When a nearby party member triggers a Nightsoul Burst, Chasca will fire a \"Burning Shadowhunt Shot\" at a nearby opponent, dealing Nightsoul-aligned Anemo DMG equal to 150% of the Shadowhunt Shell DMG from her Elemental Skill Spirit Reins, Shadow Hunt. If the party has Pyro, Hydro, Cryo, or Electro characters, the Burning Shadowhunt Shot will be converted to deal Nightsoul-aligned Elemental DMG of the corresponding Elemental Type equal to 150% of the DMG dealt by Spirit Reins, Shadow Hunt's Shining Shadowhunt Shells. DMG dealt in this way is considered Charged Attack DMG."
  },
  "Chevreuse": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Short-Range Rapid Interdiction Fire Chevreuse quickly shoulders her musket and fires at her opponent(s), dealing AoE Pyro DMG. For a short duration after Chevreuse fires a shot, she will continously restore HP to the active character on the field. The amount healed is based on her Max HP. Hold to fire in a different fashion. ________________ Hold Attack: Enter Aiming Mode, locking a target in sights to fire a precise interdiction shot. If Chevreuse has an Overcharged Ball, then she will fire the Overcharged Ball instead, dealing greater Pyro DMG in a larger area. Chevreuse gains 1 Overcharged Ball every time a nearby character in the party triggers an Overloaded reaction, and can have up to 1 Overcharged Ball at a time. Arkhe: Ousia Periodically, after Chevreuse's Short-Rapid Interdiction Fire hits, a Surging Blade wil be called forth that deals Ousia-aligned Pyro DMG.",
    "elemental_burst": " Ring of Bursting Grenades Chevreuse fires an explosive grenade at opponents with her musket, dealing AoE Pyro DMG. After the projectile hits, it will split into many secondary explosive shells. The secondary explosive shells will burst after a short interval, dealing Pyro DMG to nearby opponents.",
    "passive_talent_1": "When all party members are Pyro and Electro characters and there is at least one Pyro and one Electro character each in the party: Chevreuse grants \"Coordinated Tactics\" to nearby party members: After a character triggers the Overloaded reaction, the Pyro and Electro RES of the opponent(s) affected by this Overloaded reaction will be decreased by 40% for 6s. The \"Coordinated Tactics\" effect will be removed when the Elemental Types of the characters in the party do not meet the basic requirements for the Passive Talent.",
    "passive_talent_2": "After Chevreuse fires an Overcharged Ball using Short-Range Rapid Interdiction Fire, neaby Pyro and Electro characters in the party gain 1% increased ATK for every 1,000 Max HP Chevreuse has for 30s. ATK can be increased by up to 40% in this way."
  },
  "Chiori": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Golden troupe",
      "piece_bonus": "4pc) Increases Elemental Skill DMG by 25%. Additionally when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field.",
      "description": ""
    },
    "elemental_skill": " Fluttering Hasode Dashes nimbly forward with silken steps. Once this dash ends, Chiori will summon the automaton doll “Tamoto” beside her and sweep her blade updward, dealing AoE Geo DMG to nearby opponents based on her ATK and DEF. ________________ Hold Attack: Enter Aiming Mode to adjust the dash direction. Tamoto: • Will slash at nearby opponents at intervals, dealing AoE Geo DMG based on Chiori's ATK and DEF. • While active, if there are nearby Geo Construct(s) or Geo Construct(s) are created nearby, an additional Tamoto will be summoned next to your active characters. Only 1 additional Tamoto can be summoned in this manner, and its duration is independently counted.",
    "elemental_burst": " Hiyoku: Twin Blades Twin Blades leave their sheats as Chiori slices with clean cuts of a master tailor, dealing AoE Geo DMG based on her ATK and DEF.",
    "passive_talent_1": "Gain different effects depending on the next action you take within a short duration after using Fluttering Hasode's upward sweep. If you tap the Elemental Skill, you will trigger the Tapestry effect. If you tap your Normal Attack, the Tailoring effect will be triggered instead. ________________ Tapestry: • Switches to the next character in your roster. • Grants all your party members \"Seize the Moment\": When your active party member's Normal Attacks, Charged Attacks, and Plunging Attacks hit a nearby opponent, \"Tamoto\" will execute a coordinated attack, dealing 100% of Fluttering Hasode's upward sweep DMG as AoE Geo DMG at the opponent's location. Tailoring: • Chiori gains Geo infusion for 5s. • When on the field, if Chiori does not either tap her Elemental Skill or use a Normal Attack within a short time after using Fluttering Hasode's upward sweep, the Tailoring effect will be triggered by default.",
    "passive_talent_2": "When a nearby party member creates a Geo Construct, Chiori will gain 20% Geo DMG Bonus for 20s."
  },
  "Chongyun": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Spirit Blade: Chonghua's Layered Frost Chongyun strikes the ground with his greatsword, causing a Cryo explosion in a circular AoE in front of him that deals Cryo DMG. After a short delay, the cold air created by the Cryo explosion will coalesce into a Chonghua Frost Field, within which all DMG done through Normal and Charged Attacks by Sword, Claymore, and Polearm-wielding characters will be converted to Cryo DMG.",
    "elemental_burst": " Spirit Blade: Cloud-parting Star Performing the secret hand seals, Chongyun summons 3 giant spirit blades in mid-air that fall to the earth one by one after a short delay, exploding as they hit the ground. When the spirit blades explode, they will deal AoE Cryo DMG and launch enemies.",
    "passive_talent_1": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade: Chonghua's Layered Frost have their Normal ATK SPD increased by 8%.",
    "passive_talent_2": "When the field created by Spirit Blade: Chonghua's Layered Frost disappears, another spirit blade will be summoned to strike nearby enemies, dealing 100% of Chonghua's Layered Frost's Skill DMG as AoE Cryo DMG. Enemies hit by this blade will have their Cryo Res decreased by 10% for 8s."
  },
  "Citlali": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "scroll of the hero of cinder city",
      "piece_bonus": "4pc) After the equipping character triggers a reaction, all nearby party members gain a 12% Elemental DMG Bonus for the involved Elemental Types for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all party members gain an additional 28% Elemental DMG bonus for the Elemental Types involved in the reaction for 20s.",
      "description": ""
    },
    "elemental_skill": " Dawnfrost Darkstar Citlali deploys an Opal Shield and calls forth Itzpapa, dealing Nightsoul-aligned AoE Cryo DMG. The Opal Shield's DMG absorption scales based on Citlali's Elemental Mastery, and absorbs Cryo DMG with 250% efficiency. When it is deployed, it will cause Citlali to briefly be affected by Cryo. After using this skill, Citlali gains 24 Nightsoul points and enters the Nightsoul's Blessing state. ________________ Itzpapa Itzpapa follows the character. If Citlali has at least 50 Nightsoul points, Itzpapa enters the Opal Fire state and continuously consumes Nightsoul points to whip up a Frostfall Storm that attacks opponents within its AoE, dealing Nightsoul-aligned Cryo DMG. When Citlali's Nightsoul points are depleted, the Opal Fire state ends.",
    "elemental_burst": " Edict of Entwined Splendor Summons \"allies\" from the starry skies and the vast earth, hurling forth an ice storm to bombard the area in front and deal Nightsoul-aligned AoE Cryo DMG. This restores a set amount of Nightsoul points for Citlali, and also summons a Spiritvessel Skull near a maximum of 3 opponents within the AoE, with 1 Skull for each opponent. Spiritvessel Skulls explode after some time, dealing Nightsoul-aligned AoE Cryo DMG and restoring a set amount of Nightsoul points for Citlali.",
    "passive_talent_1": "While Itzpapa is on the field, after nearby party members trigger the Frozen or Melt reactions, the Pyro and Hydro RES of opponents affected by that reaction decreases by 20% for 12s. Additionally, Citlali will regain 16 Nightsoul points. Nightsoul points can be restored this way once every 8s.",
    "passive_talent_2": "During the Elemental Skill, Itzpapa's Frostfall Storm DMG is increased by 90% of Citlali's Elemental Mastery. During the Elemental Burst Edict of Entwined Splendor, Ice Storm DMG is increased by 1200% of Citlali's Elemental Mastery. In addition, when nearby party members trigger Nightsoul Bursts, Citlali regains 4 Nightsoul points."
  },
  "Clorinde": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Fragment of harmonic whimsy",
      "piece_bonus": "4pc) When the value of a Bond of Life increases or decreases, this character deals 18% increased DMG for 6s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Hunter's Vigil Preparing her pistolet, she enters the “Night Vigil” state, using steel and shot together. In this state, Clorinde's Normal Attacks will be transformed into “Swift Hunt” pistolet attacks, and the DMG dealt is converted into Electro DMG that cannot be overridden by infusions, and she will be unable to use Charged Attacks. Using her Elemental Skill will transform it into “Impale the Night”: Perform a lunging attack, dealing Electro DMG. The DMG done through the aforementioned method is considered Normal Attack DMG. Clorinde will exit the “Night Vigil” state when she leaves the field. ________________ Swift Hunt: • When her Bond of Life is equal to or greater than 100% of her max HP: Performs a pistolet shot. • When her Bond of Life is less than 100%, firing her pistolet will grant her Bond of Life, with the amount gained based on her max HP. The shots she fires can pierce opponents, and DMG dealt to opponents in their path is increased. Impale the Night: • When the Bond of Life value is 0%, perform a normal lunging strike. • When the Bond of Life value is less than 100% of her max HP, Clorinde is healed based on the Bond of Life Value, and the AoE of the lunging attack and the DMG dealt is increased. • Use Impale the Night: Pact when the Bond of Life's value is 100% or more of her max HP. Both the AoE and DMG dealt by the lunge are enhanced, as well as the healing multiplier.",
    "elemental_burst": " Last Lightfall Grants herself a Bond of Life based upon her own max HP before swiftly evading and striking with saber and sidearm as one, dealing AoE Electro DMG. ________________ Passive Talent: Dark-Shattering Flame After a nearby party member triggers an Electro-related reaction against an opponent, Electro DMG dealt by Clorinde's Normal Attacks and Last Lightfall will be increased by 20% of Clorinde's ATK for 15s. Max 3 stacks. Each stack is counted independently. The Maximum DMG increase achievable this way for the above attacks is 1,800. Passive Talent: Lawful Remuneration If Clorinde's Bond of Life is equal to or greater than 100% of her Max HP, her CRIT Rate will increase by 10% for 15s whenever her Bond of Life value increases or decreases. Max 2 stacks. Each stack is counted independently. Additionally, Hunter's Vigil's Night Vigil state is buffed: While it is active, the percent of healing converted to Bond of Life increases to 100%.",
    "passive_talent_1": "After a nearby party member triggers an Electro-related reaction against an opponent, Electro DMG dealt by Clorinde's Normal Attacks and Last Lightfall will be increased by 20% of Clorinde's ATK for 15s. Max 3 stacks. Each stack is counted independently. The Maximum DMG increase achievable this way for the above attacks is 1,800.",
    "passive_talent_2": "If Clorinde's Bond of Life is equal to or greater than 100% of her Max HP, her CRIT Rate will increase by 10% for 15s whenever her Bond of Life value increases or decreases. Max 2 stacks. Each stack is counted independently. Additionally, Hunter's Vigil's Night Vigil state is buffed: While it is active, the percent of healing converted to Bond of Life increases to 100%."
  },
  "Collei": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "deepwood memories",
      "piece_bonus": "4pc) After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field.",
      "description": ""
    },
    "elemental_skill": " Floral Brush Throws out a Floral Ring that deals 1 instance of Dendro DMG to targets it comes into contact with. The Floral Ring will return after a set time, dealing Dendro DMG once again.",
    "elemental_burst": " Trump-Card Kitty Throws the doll named Cuilein-Anbar, causing an explosion that deals AoE Dendro DMG, creating a Cuilein-Anbar Zone. Cuilein-Anbar will bounce around within this zone, dealing AoE Dendro DMG.",
    "passive_talent_1": "If one of your party members has triggered Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions before the Floral Ring returns, it will grant the character the Sprout effect upon return, which will continuously deal Dendro DMG equivalent to 40% of Collei's ATK to nearby opponents for 3s. If another Sprout effect is triggered during its initial duration, the initial effect will be removed.",
    "passive_talent_2": "When a character within the Cuilein-Anbar Zone triggers Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions, the Zone's duration will be increased by 1s. A single Trump-Card Kitty can be extended by up to 3s."
  },
  "Cyno": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Gilded Dreams",
      "piece_bonus": "4pc) Within 8s of triggering an Elemental Reaction, the character equipping this will obtain buffs based on the Elemental Type of the other party members. ATK is increased by 14% for each member whose Elemental Type is the same as the equipping character, and EM is increased by 50 for every member with a different Elemental Type. Each of the buffs will count up to 3 characters. This effect can be triggered once every 8s and even when not on the field.",
      "description": ""
    },
    "elemental_skill": " Secret Rite: Chasmic Soulfarer Performs a swift thrust, dealing Electro DMG to opponents along the path. ________________ When Cyno is under the Pactsworn Pathclearer state triggered by Sacred Rite: Wolf's Swiftness, he will instead unleash a Mortuary Rite that deals thunderous AOE Electro DMG and extends the duration of Pactsworn Pathclearer.",
    "elemental_burst": " Sacred Rite: Wolf's Swiftness Calls upon a divine spirit to indwell him, morphing into the Pactsworn Pathclearer. ________________ Pactsworn Pathclearer Cyno's Normal, Charged, and Plunging Attacks will be converted to Electro DMG that cannot be overridden. Cyno's Elemental Mastery and resistance to interruption will increase, and he gains immunity to Electro-Charged DMG. This effect will be canceled when Cyno leaves the field and lasts a maximum of 18s.",
    "passive_talent_1": "When Cyno is in the Pactsworn Pathclearer state activated by Sacred Rite: Wolf's Swiftness, Cyno will enter the Endseer stance at intervals. If he activates Secret Rite: Chasmic Soulfarer while affected by this stance, he will activate the Judication effect, increasing the DMG of this Secret Rite: Chasmic Soulfarer by 35%, and firing off 3 Duststalker Bolts that deal 100% of Cyno's ATK as Electro DMG. Duststalker Bolt DMG is considered Elemental Skill DMG.",
    "passive_talent_2": "Cyno's DMG values will be increased based on his Elemental Mastery as follows: • Pactsworn Pathclearer's Normal Attack DMG is increased by 150% of his Elemental Mastery. • Duststalker Bolt DMG from his Passive Talent Featherfall Judgment is increased by 250% of his Elemental Mastery."
  },
  "Dehya": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Vourukasha's Glow",
      "piece_bonus": "4pc) Elemental Skill and Elemental Burst DMG will be increased by 10%. After the equipping character takes DMG, the aforementioned DMG Bonus is increased by 80% for 5s. This effect increase can have 5 stacks. The duration of each stack is counted independently. These effects can be triggered even when the equipping character is not on the field.",
      "description": ""
    },
    "elemental_skill": " Molten Inferno This art of Dehya's own invention changes its method of use depending on the combat situation. Indomitable Flame This skill will be unleashed should there be no Fiery Sanctum field created by Dehya herself present at the time. Deals AoE Pyro DMG, and creates a field known as Fiery Sanctum. Ranging Flame This skill will be unleashed should a Fiery Sanctum field created by Dehya herself already exist. Dehya will perform a leaping attack, dealing AoE Pyro DMG before recreating a Fiery Sanctum field at her new position. A Fiery Sanctum field created this way will inherit the remaining duration of the previous field. ________________ Fiery Sanctum When an opponent within a Fiery Sanctum field takes DMG, the field will unleash a coordinated attack, dealing AoE Pyro DMG to them based on Dehya's ATK and Max HP. This effect can be triggered once every 2.5s. Active characters within this field have their resistance to interruption increased, and when such characters take DMG, a portion of that damage will be mitigated and flow into Redmane's Blood. Dehya will then take this DMG over 10s. When the mitigated DMG stored by Redmane's Blood reaches or goes over a certain percentage of Dehya's Max HP, she will stop mitigating DMG in this way.",
    "elemental_burst": " Leonine Bite Dehya enters the Blazing Lioness state and increases her resistance to interruption. Blazing Lioness In this state, Dehya will automatically and continuously unleash the Flame-Mane's Fists, dealing Pyro DMG based on her ATK and Max HP, and when its duration ends, she will unleash an Incineration Drive, dealing AoE Pyro DMG based on her ATK and Max HP. If a Fiery Sanctum field created by Dehya's own Elemental Skill \"Molten Inferno\" exists when this ability is unleashed, Dehya will retrieve it, and then create another field once Blazing Lioness's duration expires. This field will take on the retrieved field's duration at the moment of its retrieval. ________________ In this state, Dehya will be unable to cast her Elemental Skill, or perform Normal, Charged, and Plunging Attacks. \"Normal Attack: Sandstorm Assault\" and Elemental Skill \"Molten Inferno\" will be replaced by ''Roaring Barrage.'' Roaring Barrage Unleashing Roaring Barrage within 0.4s after each Flame-Mane's Fist strike will increase the speed at which the next Flame-Mane's Fist strike will be triggered.",
    "passive_talent_1": " Unstinting Succor Within 6 seconds after Dehya retrieves the Fiery Sanctum field through Molten Inferno: Ranging Flame or Leonine Bite, she will take 60% less DMG when receiving DMG from Redmane's Blood. This effect can be triggered once every 2s. ________________ Additionally, within 9s after Dehya unleashes Molten Inferno: Indomitable Flame, she will grant all party members the Gold-Forged Form state. This state will further increase a character's resistance to interruption when they are within the Fiery Sanctum field. Gold-Forged Form can be activated once every 18s.",
    "passive_talent_2": " Stalwart and True When her HP is less than 40%, Dehya will recover 20% of her Max HP and will restore 6% of her Max HP every 2s for the next 10s. This effect can be triggered once every 20s."
  },
  "Diluc": {
    "talent_priority": [
      "Elemental skill",
      "Normal attack",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Crimson Witch of Flames",
      "piece_bonus": "4pc) Increases Overloaded, Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Searing Onslaught Performs a forward slash that deals Pyro DMG. This skill can be used 3 times consecutively. Enters CD if not cast again within a short period.",
    "elemental_burst": " Dawn Releases intense flames to knock nearby enemies back, dealing Pyro DMG. The flames then converge into the weapon, summoning a Phoenix that flies forward and deals massive Pyro DMG to all enemies in its path. The Phoenix explodes upon reaching its destination, causing a large amount of AoE Pyro DMG. The searing flames that run down his blade cause Diluc's Normal and Charged Attacks to deal Pyro DMG for a time.",
    "passive_talent_1": "Diluc's Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s.",
    "passive_talent_2": "The Pyro Enchantment provided by Dawn lasts for 4s longer. Additionally, Diluc gains 20% Pyro DMG Bonus during the duration of this effect."
  },
  "Diona": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Icy Paws Fires an Icy Paw that deals Cryo DMG to enemies and forms a shield on hit. The shield's DMG Absorption scales based on Diona's Max HP, and its duration scales off the number of Icy Paws that hit their target. Press: Rapidly fires off 2 Icy Paws. ________________ Hold Attack: Dashes back quickly before firing five Icy Paws. The shield created by a Hold attack will gain a 75% DMG Absorption Bonus. The shield has a 250% Cryo DMG Absorption Bonus, and will cause your active character to become affected by Cryo at the point of formation for a short duration.",
    "elemental_burst": " Signature Mix Tosses out a special cold brew that deals AoE Cryo DMG and creates a Drunken Mist in an AoE. ________________ Drunken Mist: Deals continuous Cryo DMG to enemies within the field. Continuously regenerates the HP of characters within the field.",
    "passive_talent_1": "Characters shielded by Icy Paws have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%.",
    "passive_talent_2": "Opponents who enter the AoE of Signature Mix have 10% decreased ATK for 15s."
  },
  "Emilie": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Unfinished Reverie(4pc) After leaving combat for 3s, DMG dealt increases by 50%. In combat, if no Burning opponents are nearby for more than 6s, this DMG Bonus will decrease by 10% per second until it reaches 0%. When a Burning opponent exists, it will increase by 10% instead until it reaches 50%. This effect still triggers if the equipping character is off-field.",
      "piece_bonus": "",
      "description": ""
    },
    "elemental_skill": " Fragrance Extraction Creates a Lumidouce Case that deals AoE Dendro DMG. Lumidouce Case • Fires Puffs of Puredew at nearby opponents at intervals, dealing Dendro DMG. • When nearby opponents are affected by Burning, they will give off Scents at intervals, and 1 Scent can be created this way every 2s. The Lumidouce Case collects nearby Scents. The Lumidouce Case will level up after gathering 2 of them, after which it will fire 1 extra Puff of Puredew when firing, while the DMG dealt by and DMG AOE of the above attack will also be increased. • 1 Lumidouce Case created by Emilie herself can exist at any one time. The Case starts at Level 1 and can go up to Level 2. If the Case does not collect any Scents for 8s while it is on the field, it will go back to Level 1. Arkhe: Pneuma At intervals, after Emilie creates a Lumidouce Case this way, a Spiritbreath Thorn will descend in front of her and pierce her opponent, dealing Pneuma-aligned Dendro DMG.",
    "elemental_burst": " Aromatic Exoplication Guiding the fragrances collected within the Case, Emilie converts them into pure Dendro energy, creating a Level 3 Lumidouce Case and stowing existing Cases away. While it exists, the Level 3 Lumidouce Case will not gather nearby Scents, but it will continuously cause Scented Dew to descend, attacking opponents within range and dealing Dendro DMG. During this time, 1 drop of Scented Dew will descend every 0.3 seconds, and 1 opponent can become the target every 0.7 seconds. When the duration ends, a Level 1 Lumidouce Case will be recreated. If a Lumidouce Case was stowed away when using Aromatic Explication, then the Case that was stowed away will be deployed instead, and its duration will be reset. While Aromatic Explication is active, the Elemental Skill \"Fragrance Extraction\" will not create a Lumidouce Case.",
    "passive_talent_1": "Each time it collects 2 Scents, the Level 2 Lumidouce Case will consume Scents and release Cleardew Cologne that deals AoE Dendro DMG equal to 600% of Emilie's ATK to opponents. This DMG is not considered Elemental Skill DMG.",
    "passive_talent_2": "Emilie deals increased DMG to Burning opponents based on her ATK, with every 1,000 ATK increasing DMG dealt by 15%. The maximum DMG bonus that can be gained this way is 36%. Note: Emilie is particularly good for teams that utilise the Burning reaction, and the recommended artifact set (Unfinished Reverie) reflects that."
  },
  "Dori": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Spirit-Warding Lamp: Troubleshooter Cannon Directs a Spirit-Warding Lamp to fire off a Troubleshooter Shot at opponents, dealing Electro DMG. After the troubleshooter Shot hits, it will create 2 After-Sales Service Rounds that will automatically track opponents and deal Electro DMG.",
    "elemental_burst": " Alcazarzaray's Exactitude Summons a Jinni that can connect to a nearby character. ________________ Jinni Constantly regenerates HP and Elemental Energy. ・When the connector between the Jinni and the character touches opponents, it will deal Electro DMG.",
    "passive_talent_1": "Dori's first ascension passive reduces her Elemental Skill cooldown when a character tethered to the Jinni deals an Electro Elemental Reaction. This means that any Elemental character that triggers an Electro Reaction can reduce Dori's E.Skill cooldown!",
    "passive_talent_2": ""
  },
  "Eula": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Pale flame",
      "piece_bonus": "4pc) When an Elemental skill hits an opponent, ATK is increased by 9% for 7s. This effect stacks up to 2 times and can be triggered once every 0.3s. Once 2 stacks are reached, 2-set effect is doubled.",
      "description": ""
    },
    "elemental_skill": " Icetide Vortex Sharp frost, swift blade. Press Slashes swiftly, dealing Cryo DMG. When it hits an opponent, Eula gains a stack of Grimheart that stacks up to 2 times. These stacks can only be gained once every 0.3s. ________________ Hold Attack: Wielding her sword, Eula consumes all the stacks of Grimheart and lashes forward, dealing AoE Cryo DMG to opponents in front of her. If Grimheart stacks are consumed, surrounding opponents will have their Physical RES and Cryo RES decreased. Each consumed stack of Grimheart will be converted into an Icewhirl Brand that deals Cryo DMG to nearby opponents. ________________ Grimheart: Increases Eula's resistance to interruption and DEF.",
    "elemental_burst": " Glacial Illumination Brandishes her greatsword, dealing Cryo DMG to nearby opponents and creating a Lightfall Sword that follows her around for a duration of up to 7s. While present, the Lightfall Sword increases Eula's resistance to interruption. When Eula's own Normal Attack, Elemental Skill, and Elemental Burst deal DMG to opponents, they will charge the Lightfall Sword, which gain an energy stack once every 0.1s. ________________ Once its duration ends, the Lightfall sword will descend and explode violently, dealing Physical DMG to nearby opponents. This DMG scales on the number of energy stacks the Lightfall Sword has accumulated. If Eula leaves the field, the Lightfall Sword will explode immediately. Eula's Elemental Burst, Glacial Illumination, is her main burst damage source. Upon dealing DMG using her Normal Attack, Elemental Skill, and Burst will charge her Lightfall Sword and explode once the duration ends. Her Elemental Burst also increases her Physical DMG, allowing her to deal even more damage to enemies",
    "passive_talent_1": "If 2 stacks of Grimheart are consumed upon unleashing the Holding Mode of Icetide Vortex, a Shattered Lightfall Sword will be created that will explode immediately, dealing 50% of the basic Physical DMG dealt by a Lightfall Sword created by Glacial Illumination.",
    "passive_talent_2": "When Glacial Illumination is cast, the CD of Icetide Vortex is reset and Eula gains 1 stack of Grimheart."
  },
  "Faruzan": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Venerer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Wind Realm of Nasamjnin Faruzan deploys a polyhedron that deals AoE Anemo DMG to nearby opponents. She will also enter the Manifest Gale state. While in the Manifest Gale state, Faruzan’s next fully charged shot will consume this state and will become a Hurricane Arrow that contains high-pressure currents. This arrow deals Anemo DMG based on the DMG of a fully charged Aimed Shot from “Normal Attack: Parthian Shot.” ________________ Pressurized Collapse The Hurricane Arrow will apply a Pressurized Collapse effect to the opponent or character hit. This effect will be removed after a short delay, creating a vortex that deals AoE Anemo DMG and pulls nearby objects and opponents in. If the Hurricane Arrow does not hit any opponent or character, it will create a Pressurized Collapse effect at its point of impact. The vortex DMG is considered Elemental Skill DMG.",
    "elemental_burst": " The Wind's Secret Ways Faruzan deploys a Dazzling Polyhedron that unleashes a Whirlwind Pulse and deals AoE Anemo DMG. While the Dazzling Polyhedron persists, it will continuously move along a triangular path. Once it reaches each corner of that triangular path, it will unleash 1 more Whirlwind Pulse. ________________ Whirlwind Pulse • When the Whirlwind Pulse is unleashed, it will apply Perfidious Wind’s Bale to nearby opponents, decreasing their Anemo RES. • The Whirlwind Pulse will also apply Prayerful Wind’s Benefit to all nearby party members when it is unleashed, granting them an Anemo DMG Bonus.",
    "passive_talent_1": "When Faruzan is in the Manifest Gale state created by Wind Realm of Nasamjnin, the amount of time taken to charge a shot is decreased by 60%, and she can apply The Wind’s Secret Ways‘ Perfidious Wind’s Bale to opponents who are hit by the vortex created by Pressurized Collapse",
    "passive_talent_2": "When characters affected by The Wind’s Secret Ways‘ Prayerful Wind’s Gift deal Anemo DMG using Normal, Charged, Plunging Attacks, Elemental Skills, or Elemental Bursts to opponents, they will gain the Hurricane Guard effect: This DMG will be increased based on 32% of Faruzan’s Base ATK. 1 instance of Hurricane Guard can occur once every 0.8s. This DMG Bonus will be cleared after Prayerful Wind’s Benefit expires or after the effect is triggered once."
  },
  "Fischl": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "golden troupe",
      "piece_bonus": "4pc) Increases Elemental Skill DMG by 25%. Additionally when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field.",
      "description": ""
    },
    "elemental_skill": " Nightrider Summons Oz. The night raven forged of darkness and lightning descends upon the land, dealing Electro DMG in a small AoE. For the ability's duration, Oz will continuously attack nearby enemies with Freikugel. ________________ Hold Attack: Hold to adjust the location Oz will be summoned to. Tap again any time during the ability's duration to once again summon him to Fischl's side. Both Fischl's Elemental Skill and Burst will summon Oz. Keeping Oz on the battlefield as long as possible is the key to maximizing Fischl's DMG as either Sub DPS or Main DPS.",
    "elemental_burst": " Midnight Phantasmagoria Summons Oz to spread his twin wings of twilight and defend Fischl. Has the following properties during the ability's duration: ・Fischl takes on Oz's form, greatly increasing her Movement Speed. ________________ ・Strikes nearby enemies with lightning, dealing Electro DMG to enemies she comes into contact with. Each Enemy can only be struck once. ・Once this ability's effects end, Oz will remain on the battlefield and attack his Prinzessin's foes. If Oz is already on the field, then this will reset the duration of his presence.",
    "passive_talent_1": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing AoE Electro DMG equal to 152.7% of the arrow's DMG.",
    "passive_talent_2": "If your active character triggers an Electro-related Elemental Reaction when Oz is on the field, the enemy shall be stricken with Thundering Retribution, dealing Electro DMG equal to 80% of Fischl's ATK."
  },
  "Freminet": {
    "talent_priority": [
      "elemental skill",
      "normal attack",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "pale flame",
      "piece_bonus": "4pc) When an Elemental skill hits an opponent, ATK is increased by 9% for 7s. This effect stacks up to 2 times and can be triggered once every 0.3s. Once 2 stacks are reached, 2-set effect is doubled.",
      "description": ""
    },
    "elemental_skill": " Pressurized Floe Perform an upward thrust that deals Cryo DMG and causes Freminet to enter Pers Timer for 10s. While Pers Timer is active, his Elemental Skill will turn into Shaterring Pressure. ________________ Pers Timer When Freminet uses Normal Attacks, he will also unleash waves of frost that deal Cryo DMG and increase Pers's Pressure Level. The accompanying Cryo DMG dealt this way is considered Elemental Skill DMG. Shattering Pressure Executes different sorts of attacks based on the Pressure Level of Pers Timer, and then cancels Pers Timer.",
    "elemental_burst": " Pressurized Floe Perform an upward thrust that deals Cryo DMG and causes Freminet to enter Pers Timer for 10s. While Pers Timer is active, his Elemental Skill will turn into Shaterring Pressure. ________________ Pers Timer When Freminet uses Normal Attacks, he will also unleash waves of frost that deal Cryo DMG and increase Pers's Pressure Level. The accompanying Cryo DMG dealt this way is considered Elemental Skill DMG. Shattering Pressure Executes different sorts of attacks based on the Pressure Level of Pers Timer, and then cancels Pers Timer.",
    "passive_talent_1": "When Freminet unleashes Pressurized Floe: Shattering Pressure, if Pers Timer has yet to reach Pressure Level 4, the CD of Pressurized Floe will be decreased by 1s.",
    "passive_talent_2": "When Freminet triggers Shatter against opponents, the DMG dealt by Pressurized Floe: Shattering Pressure will be increased by 40% for 5s."
  },
  "Furina": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "golden troupe",
      "piece_bonus": "4pc) Increases Elemental Skill DMG by 25%. Additionally when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field.",
      "description": ""
    },
    "elemental_skill": "Easily her best asset, Furina's Elemental Skill summons her minions that either deals DMG to opponents (Ousia) or heals party members (Pneuma) based on her Arkhe alignment!",
    "elemental_burst": " Let the People Rejoice Rouses the impulse to revel, creating a stage of foam that will deal AoE Hydro DMG based on Furina's Max HP and cause nearby party members to enter the Universal Revelry state: During this time, when nearby party members' HP increases or decreases, 1 Fanfare point will be granted to Furina for each percentage point of their Max HP by which their HP changes. At the same time, Furina will increase the DMG dealt by and Incoming Healing Bonus of all nearby party members based on the amount of Fanfare she has. When the duration ends, Furina's Fanfare points will be cleared.",
    "passive_talent_1": "When the active character in your party receives healing, if the source of the healing is not Furina herself and the healing overflows, then Furina will heal a nearby party member for 2% of their Max HP once every 2s within the next 4s.",
    "passive_talent_2": "Every 1,000 points of Furina's Max HP can buff the different Arkhe-aligned Salon Solitaire in the following ways: Will increase Salon Member DMG dealt by 0.7%, up to a maximum of 28%. Will decrease active character healing interval of the Singer of Many Waters by 0.4%, up to a maximum of 16%. This passive talent is responsible for Furina's ability to output respectable damage and healing despite being designed as a buffer and HP-scaling character. This bonus caps at 28%, which is roughly 40,000 HP for Furina."
  },
  "Gaming": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Crimson witch of flames",
      "piece_bonus": "4pc) Increases Overloaded, Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Bestial Ascent Pounces forward using Wushou arts, leaping high into the air after coming into contact with a target or surface. After Gaming has used Bestial Ascent to rise into the air, if he immediately uses a Plunging Attack: Charmed Cloudstrider instead. ________________ Plunging Attack: Charmed Cloudstrider The DMG from Plunging Attacks caused by Bestial Ascent is converted to Pyro DMG that cannot be overridden by other elemental infusions. Upon landing, Gaming will consume a fixed amount of HP. Gaming's HP cannot be reduced below 10% by this method. Charmed Cloudstrider DMG is considered Plunging Attack DMG.",
    "elemental_burst": " Suanni's Gilded Dance Gaming enters Wushou Stance, briefly applying Pyro to him, recovering a fixed amount of HP, and summons his companions, the Suanni Man Chai, to smash into his target, dealing AoE Pyro DMG. After bashing his target, Man Chai will roll to a nearby location before moving towards Gaming. When it links up with Gaming, Man Chai will leave the field and reset the CD for Gaming's Elemental Skill, Bestial Ascent. ________________ While Wushou Stance is active, his resistance to interruption is increased, and when Gaming lands with Charmed Cloudstrider attack or completes the forward pounce attack from Bestial Ascent with over 50% HP, he will summon Man Chai again. Each Gaming can only have 1 Man Chai on the field simultaneously. This effect will be canceled once Gaming leaves the field.",
    "passive_talent_1": "After Bestial Ascent's Plunging Attack: Charmed Cloudstrider hits an opponent, Gaming will regain 1.5% of his Max HP once every 0.2s for 0.8s.",
    "passive_talent_2": "When Gaming has less than 50% HP, he will receive a 20% Incoming Healing Bonus. When Gaming has 50% HP or more, Plunging Attack: Charmed Cloudstrider will deal 20% more DMG. Note that Xianyun is almost essential for Gaming teams as she allows him to be played as a plunge DPS. At C6, Gaming can compete with most 5-star characters in terms of damage."
  },
  "Ganyu": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Shimenawa's Reminiscence",
      "piece_bonus": "4pc) ATK +18%.",
      "description": ""
    },
    "elemental_skill": " Trail of the Qilin Leaving a single Ice Lotus behind, Ganyu dashes backward, shunning all impurity and dealing AoE Cryo DMG. The Ice Lotus continuously taunts surrounding opponents, attracting them to attack it. Its endurance scales based on Ganyu's Max HP, and it blooms profusely when destroyed or once its duration ends, dealing AoE Cryo DMG.",
    "elemental_burst": " Celestial Shower Coalesces atmospheric frost and snow to summon a Sacred Cryo Pearl that exorcises evil. While active, the Sacred Cryo Pearl will continuously rain down shards of ice, striking opponents within its AoE and dealing Cryo DMG.",
    "passive_talent_1": "After firing a Frostflake Arrow, the CRIT Rate of subsequent Frostflake Arrows and their resulting bloom effects is increased by 20% for 5s.",
    "passive_talent_2": "Celestial Shower grants a 20% Cryo DMG Bonus to active party members in the AoE."
  },
  "Gorou": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "husk of opulent dreams",
      "piece_bonus": "4pc) DEF +30%",
      "description": ""
    },
    "elemental_skill": " Inuzaka All-Round Defense Deals AoE Geo DMG and sets up up a General's War Banner. ________________ General's War Banner Provides up to 3 buffs to active characters within the skill's AoE based on the number of Geo characters in the party at the time of casting: ・1 Geo character: Adds ''Standing Firm'' - DEF Bonus. ・ 2 Geo characters: Adds ''Impregnable'' - Increased resistance to interruption. ・3 Geo characters: Adds ''Crunch'' - Geo DMG Bonus. Gorou can deploy only 1 General's War Banner on the field at any one time. Characters can only benefit from 1 General's War Banner at a time. When a party member leaves the field, the active buff will last for 2s.",
    "elemental_burst": " Juuga: Forward Unto Victory Displaying his valor as a general, Gorou deals AoE Geo DMG and creates a field known as a General's Glory to embolden his comrades. ________________ General's Glory ・Buffs active characters in the AoE based on the Geo characters in the party. Moves with your active character. ・Generates 1 Crystal Collapse every 1.5s that deals AoE Geo DMG to 1 enemy in the AoE. ・Pulls 1 elemental shard in the AoE to your position every 1.5s (elemental shards by Crystallize reactions). If a General's War Banner created by Gorou currently exists on the field when this ability is used, it will be destroyed. In addition, for the duration of General's Glory, Gorou's Elemental Skill \"Inuzaka All Round Defense\" will not create the General's War Banner. If Gorou falls, the effects of General's Glory will be cleared.",
    "passive_talent_1": "After using Juuga: Forward Unto Victory, all nearby party members' DEF is increased by 25% for 12s.",
    "passive_talent_2": "Gorou receives the following DMG Bonuses to his attacks based on his DEF: ・Inuzaka All-Round Defense: Skill DMG increased by 156% of DEF ・Juuga: Forward Unto Victory: Skill DMG and Crystal Collapse DMG increased by 15.6% of DEF"
  },
  "Shikanoin-Heizou": {
    "talent_priority": [
      "elemental skill",
      "normal attack",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Heartstopper Strike Tap: Wields the swift winds to launch a Heartstopper Strike that deals Anemo DMG. ________________ Hold: Charges energy to unleash an even stronger blow. He will obtain the Declension effect while charging, which will increase the power of the Heartstopper Strike. When the skill button is released or the skill duration ends, he will strike forward, dealing Anemo DMG. Declension Increases the power of the next Heartstopper Strike. Max 4 stacks. When you possess 4 Declension stacks, the Conviction effect will be produced, which will cause the next Heartstopper Strike to be even stronger and have a larger AoE.",
    "elemental_burst": " Windmuster Kick Leaps into the air and uses the Fudou Style Vacuum Slugger and kicks his opponent. The Vacuum Slugger will explode upon hit and create an Arresting Windtunnel that pulls in nearby objects and opponents, dealing AoE Anemo DMG. ________________ Elemental Absorption: When Fudou Style Vacuum Slugger hits enemies affected by Hydro, Pyro, Cryo or Electro, it afflicts them with Windmuster Iris. Moments later, Windmuster Iris explodes and dissipates, dealing AoE DMG of the corresponding elemental type. Fudou Style Vacuum Slugger can afflict a maximum of four enemies with the Windmuster Iris. A single enemy cannot be afflicted by Irises of different elemental types at the same time.",
    "passive_talent_1": "When Shikanoin Heizou activates a Swirl reaction while on the field, he will gain 1 Declension stack for Heartstopper Strike. This effect can be triggered once every 0.1s",
    "passive_talent_2": "After Shikanoin Heizou's Heartstopper Strike hits an opponent, increase all party members' (excluding Shikanoin Heizou) Elemental Mastery by 80 for 10s."
  },
  "Hu-Tao": {
    "talent_priority": [
      "Normal attack/Elemental skill",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Crimson witch of flames",
      "piece_bonus": "4pc) Increases Overloaded, Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Guide to Afterlife Only an unwavering flame can cleanse the impurities of this world. Hu Tao consumes a set portion of her HP to knock the surrounding enemies back and enter the Paramita Papilio state. ________________ Paramita Papilio State: ・Increases Hu Tao’s ATK based on her Max HP at the time of entering this state. ATK Bonus gained this way cannot exceed 400% of Hu Tao’s Base ATK. ・Converts attack DMG to Pyro DMG, which cannot be overridden by any other elemental infusion. Increases Hu Tao’s resistance to interruption. Paramita Papilio ends when its duration is over, or when Hu Tao has left the battlefield or fallen. In the Paramita Papilio state, Hu Tao’s Charged Attacks apply the Blood Blossom effect to enemies it hits. ________________ Blood Blossom Effect: Enemies affected by Blood Blossom will take Pyro DMG every 4s. This DMG is considered Elemental Skill DMG. Each enemy can be affected by only one Blood Blossom effect at a time, and its duration may only be refreshed by Hu Tao herself.",
    "elemental_burst": " Spirit Soother Commands a blazing spirit to attack, dealing Pyro DMG in a large AoE. Upon striking the enemy, regenerates a percentage of Hu Tao's Max HP. This effect can be triggered up to 5 times, based on the number of enemies hit. If Hu Tao's HP is below or equal to 50% when the enemy is hit, both the DMG and HP Regeneration are increased.",
    "passive_talent_1": "When Hu Tao's HP is equal to or less than 50%, her Pyro Damage Bonus is increased by 33%",
    "passive_talent_2": "When a Paramita Papilio state activated by Guide to Afterlife ends, all allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 8s."
  },
  "Itto": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "husk of opulent dreams",
      "piece_bonus": "4pc) A character equipped with this Artifact set will obtain the Curiosity effect in the following conditions: When on the field, the character gains 1 stack after hitting an opponent with a Geo attack, triggering a maximum of once every 0.3s. When off the field, the character gains 1 stack every 3s. Curiosity can stack up to 4 times, each providing 6% DEF and a 6% Geo DMG Bonus. When 6 seconds pass without gaining a Curiosity stack, 1 stack is lost.",
      "description": ""
    },
    "elemental_skill": " Masatsu Zetsugi: Akaushi Burst! Hurls Ushi, the young akaushi bull and auxiliary member of the Arataki Gang, dealing Geo DMG to opponents on hit. When Ushi hits opponents, Arataki Itto gains 1 stack of Superlative Superstrength. ________________ Hold Attack: Adjusts throwing angle. ________________ Ushi Ushi will remain on the field and provide support. • Taunts surrounding opponents. • When Ushi takes DMG, Arataki Itto gains 1 stack of Superlative Superstrength every 2s. • Inherits HP based on a percentage of Itto's Max HP. • It will grant Arataki Itto 1 stack of Superlative Superstrength when it leaves. Ushi is considered a Geo construct. Arataki Itto can only deploy 1 Ushi on the field at any one time.",
    "elemental_burst": " Royal Descent: Behold, Itto the Evil! Time to show 'em the might of the Arataki Gang! For a time, Itto lets out his inner Raging Oni King, wielding his Oni King's Kanabou in battle. ________________ Raging Oni King State • Converts Itto's Normal, Charged, and Plunging Attacks to Geo DMG. This cannot be overriden. • Increases Itto's Normal Attack SPD. Also increases his ATK based on his DEF. • The 1st and 3rd combos of his Normal Attack will grant Itto Superlative Superstrength stacks when it hits opponents. • Decreased Itto's Elemental and Physical RES by 20%. The Raging Oni King state will be cleared when Itto leaves the field. Itto's Elemental Burst, Royal Descent: Behold, Itto the Evil!, will infuse his Normal, Charged, and Plunge Attacks with the Geo Element, and gain an ATK bonus based on his DEF. In addition, he can now gain stacks on the 1st and 3rd Normal Attacks. Itto will have decreased Physical and Elemental RES during the Burst Duration, but will gain increased ATK and ATK SPD, making him a force to be reckoned with!",
    "passive_talent_1": "When Arataki Itto uses consecutive Arataki Kesagiri, he obtains the following effects: • Each slash increases the ATK SPD of the next slash by 10%. Max ATK SPD increase is 30%. • Increases his resistance to interruption. These effects will be cleared once he stops performing consecutive slashes.",
    "passive_talent_2": "Arataki Kesagiri DMG is increased by 35% of Arataki Itto's DEF."
  },
  "Iansan":{
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "scroll of the hero of cinder city",
      "piece_bonus": "4pc) After the equipping character triggers a reaction, all nearby party members gain a 12% Elemental DMG Bonus for the involved Elemental Types for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all party members gain an additional 28% Elemental DMG bonus for the Elemental Types involved in the reaction for 20s.",
      "description": ""
    },
    "elemental_skill": "Iansan's Elemental Skill allows her to dash forward and strike the ground near the enemy, dealing AoE Electro DMG. This seems to be used as a general damage tool and as a way to regain Elemental Energy with the amount of particles generated.",
    "elemental_burst":"Iansan strikes the area around her, dealing AoE Electro DMG and summoning a Kinetic Energy Scale that follows the active character around. For the duration of her Elemental Burst, this Kinetic Energy Scale raises the active character's ATK by a portion of Iansan's own ATK. Iansan's Elemental Burst scales not only on her ATK, but also the amount of Nightsoul Points she has since her ATK buff's potency is based on how high her Nightsoul gauge is. Rewards Frequency in Movement Iansan gains Nightsoul Points through the movement of other active characters that is not her, meaning fast-moving DPS characters such as Mavuika or Kinich can take advantage of this for bigger buffs."},
  "Jean": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Gale Blade Focusing on the might of the formless wind around her blade, Jean releases a miniature storm, launching enemies in the direction she aims at, dealing massive Anemo DMG. ________________ Hold Attack: At the cost of continued stamina consumption, Jean can command the whirlwind to pull surrounding enemies towards her front. Direction can be adjusted. Character is immobile during skill duration.",
    "elemental_burst": " Dandelion Breeze Calling upon the wind's protection, Jean creates a swirling Dandelion Field, launching surrounding enemies and causing Anemo DMG. At the same time, she instantly regenerates a large amount of HP for all party members. HP restored scales off Jean's ATK. ________________ Dandelion Field ・Continuously regenerates HP for one ally and continuously imbues them with Anemo. ・Deals Anemo DMG to enemies entering or exiting the Field.",
    "passive_talent_1": " Hits by Jean's Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean's ATK for all party members.",
    "passive_talent_2": "Using Dandelion Breeze will regenerate 20% of its Energy."
  },
  "Kachina": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "scrolls of the hero of cinder city",
      "piece_bonus": "4pc) After the equipping character triggers a reaction, all nearby party members gain a 12% Elemental DMG Bonus for the involved Elemental Types for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all party members gain an additional 28% Elemental DMG bonus for the Elemental Types involved in the reaction for 20s.",
      "description": ""
    },
    "elemental_skill": " Go, Go Turbo Twirly! Fight alongside the turbo trusty Turbo Twirly! Summons Turbo Twirly. When the skill is Held and released, Kachina will summon and ride Turbo Twirly. After the Skill is used, Kachina will gain 60 Nightsoul points and enter the Nightsoul's Blessing state. ________________ Nightsoul's Blessing: Kachina Turbo Twirly's various actions consume Kachina's Nightsoul points. The Nightsoul's Blessing state will end when these points have been depleted. Turbo Twirly Can exist independently or be ridden and operated by Kachina. When Turbo Twirly is present, Kachina's Elemental Skill, \"Go, Go Turbo Twirly!\", will change to an option to Mount/Dismount Turbo Twirly.",
    "elemental_burst": " Time to Get Serious! Striking the ground, Kachina deals AoE Geo DMG based on her DEF and creates a Turbo Drill Field. The Field increases Turbo Twirly's attack AoE and its Movement SPD when Kachina is riding it. If Kachina's own Turbo Twirly is present when this is used, the Turbo Twirly will be summoned to her side.",
    "passive_talent_1": " After nearby party members trigger a Nightsoul Burst, Kachina's Geo DMG Bonus increases by 20% for 12s.",
    "passive_talent_2": " Turbo Twirly's DMG is increased by 20% of Kachina's DEF."
  },
  "Kaeya": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Blizzard strayer",
      "piece_bonus": "4pc) When a character attacks an enemy affected by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%.",
      "description": ""
    },
    "elemental_skill": " Frostgnaw Unleashes a frigid blast, dealing Cryo DMG to enemies in front of Kaeya.",
    "elemental_burst": " Glacial Waltz Coalescing the frost in the air, Kaeya summons 3 icicles that revolve around him. These icicles will follow the character around and deal Cryo DMG to enemies in their path for so long as they persist.",
    "passive_talent_1": "Every hit with Frostgnaw regenerates HP for Kaeya equal to 15% of his ATK.",
    "passive_talent_2": "Enemies Frozen by Frostgnaw will drop additional Elemental Particles. Frostgnaw may only produce a maximum of 2 additional Elemental Particles per use."
  },
  "Kaveh": {
    "talent_priority": [
      "Elemental burst",
      "normal attack",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Flower of Paradise Lost",
      "piece_bonus": "4pc) The equipping character's Bloom, Hyperbloom, and Burgeon reaction DMG are increased by 40%. Additionally, after the equipping character triggers Bloom, Hyperbloom, or Burgeon, they will gain another 25% bonus to the effect mentioned prior. Each stack of this lasts 10s. Max 4 stacks simultaneously. This effect can only be triggered once per second. The character who equips this can still trigger its effects when not on the field.",
      "description": ""
    },
    "elemental_skill": " Artistic Ingenuity Use Mehrak's mapping ability to initiate a radial scan that deals AoE Dendro DMG. All Dendro Cores inside the AoE will immediately burst.",
    "elemental_burst": " Painted Dome Complete unleashes Mehrak's energy and creates a cubic scanned space, dealing AoE Dendro DMG and causing all Dendro Cores within the AoE to burst. ________________ Kaveh is granted increased Normal, Charged, and Plunging Attack AoE, and converts his attack DMG to Dendro DMG that cannot be overridden. All Dendro Cores created by your party through Bloom will deal additional DMG when they burst. Increases Kaveh's resistance to interruption.",
    "passive_talent_1": " A Craftsman's Curious Conceptions During Painted Dome, after Kaveh's Normal, Charged, or Plunging Attacks hit opponents, his Elemental Mastery will increase by 25. This effect can be triggered once every 0.1s. Max 4 stacks. This effect will be canceled when Painted Dome's effects end.",
    "passive_talent_2": " An Architect's Undertaking When DMG dealt by a Dendro Core hits Kaveh, he will regain HP equal to 300% of his Elemental Mastery. This effect can be triggered once every 0.5 seconds."
  },
  "Kaedehara-Kazuha": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Chihayaburu Unleashes a secret technique as fierce as the rushing wind that pulls objects and opponents towards Kazuha's current position before launching opponents within the AoE, dealing Anemo DMG and lifting Kazuha into the air on a rushing gust of wind. Within 10s of remaining airborne after casting Chihayaburu, Kazuha can unleash a powerful Plunging Attack known as Midare Ranzen. Press Can be used in mid-air. ________________ Hold Attack: Charges up before unleashing greater Anemo DMG over a larger AoE than Press Mode. ________________ Plunging Attack: Midare Ranzan When Plunging Attack is performed using the effects of the Elemental Skill Chihayaburu, Plunging Attack DMG is converted to Anemo DMG. On landing, Kazuha creates a small wind tunnel via a secret blade technique that pulls in nearby objects and opponents. Midare Ranzan's DMG is considered Plunging Attack DMG. Kazuha can pull enemies and objects towards his position when using Chihayaburu, which you can use for crowd control!",
    "elemental_burst": " Kazuha Slash The signature techniques of Kazuha's self-styled bladework — a single slash that strikes with the force of the first winds of autumn, dealing AoE Anemo DMG. The blade's passage will leave behind a frield named ''Autumn Whirlwind'' that periodically deals AoE Anemo DMG to opponents within it's range. ________________ Elemental Absorption: If Autumn Whirlwind comes into contract with Hydro/Pyro/Cryo/Electro, it will deal additional elemental DMG of that type. Elemental Absorption may only occur once per use. Kazuha's Elemental Burst, Kazuha Slash, expands into a wide AoE and deals continuous Swirl DMG to enemies inside.",
    "passive_talent_1": " Soumon Swordsmanship If Chihayaburu comes into contact with Hydro/Pyro/Cryo/Electro when cast, Chihayaburu will absorb that element and if Plunging Attack: Midare Ranzan is used before the effect expires, it will deal an additional 200% ATK of the absorbed elemental type as DMG. This will be considered Plunging Attack DMG. Elemental Absorption may only occur once per use of Chihayaburu. Following the Swirl Priority, this allows Kazuha to deal an extra instance of Elemental damage during the Enhanced Plunge from his Skill on top of swirling and shredding the element itself using Viridescent Venerer.",
    "passive_talent_2": " Poetics of Fuubutsu Upon triggering a Swirl reaction, Kaedehara Kazuha will grant teammates a 0.04% Elemental DMG Bonus to their corresponding Element for every point of Elemental Mastery he has for 8s. Bonuses for different elements obtained through this method can co-exist. Poetics of Fuubutsu gives the team an Elemental DMG bonus for 8s every time Kazuha triggers a Swirl reaction. This gives even more Elemental DMG to your team!"
  },
  "Keqing": {
    "talent_priority": [
      "Normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Thundering Fury",
      "piece_bonus": "4pc) Increases damage caused by Overloaded, Electro-Charged, Superconduct, and Hyperbloom by 40%, and the DMG Bonus conferred by Aggravate is increased by 20%. When Quicked or the aforementioned Elemental Reactions are triggered, Elemental Skill CD is decreased by 1s. Can only occur once every 0.8s",
      "description": ""
    },
    "elemental_skill": " Stellar Restoration Hurls a Lightning Stiletto that annihilates her enemies like the swift thunder. When the Stiletto hits its target, it deals Electro DMG to enemies in a small AoE, and places a Stiletto Mark on the spot hit. ________________ Hold Attack: Hold to adjust the direction in which the Stiletto shall be thrown. Stilettos thrown by the Hold attack mode can be suspended in mid-air, allowing Keqing to jump to them when using Stellar Restoration a second time. ________________ Elemental Absorption: Lightning Stiletto If Keqing uses Stellar Restoration again or uses a Charged Attack while its duration lasts, it will clear the Stiletto Mark and produce different effects: ・If she uses Stellar Restoration again, she will blink to the location of the Mark and unleash one slashing attack that deals AoE Electro DMG. When blinking to a Stiletto that was thrown from a Holding attack, Keqing can leap across obstructing terrain. ・If Keqing uses a Charged Attack, she will ignite a series of thundering cuts at the Mark's location, dealing AoE Electro DMG.",
    "elemental_burst": " Starward Sword Keqing unleashes the power of lightning, dealing Electro DMG in an AoE. ________________ She then blends into the shadow of her blade, striking a series of thunderclap-blows to nearby enemies simultaneously that deal multiple instances of Electro DMG. The final attack deals massive AoE Electro DMG.",
    "passive_talent_1": " Thundering Penance Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing's Normal and Charged Attacks are converted to Electro DMG.",
    "passive_talent_2": " Aristocratic Dignity When casting Starward Sword, Keqing's CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s."
  },
  "Kinich": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Obsidian codex",
      "piece_bonus": "4pc) After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.",
      "description": ""
    },
    "elemental_skill": " Canopy Hunter: Riding High Kinich uses his big-game hunting skills to either move swiftly or attack his opponent. When there is an opponent or object that can be attacked nearby, he will attach a grappling hook to the target and enter Nightsoul's Blessing with 0 Nightsoul points. If neither is nearby, he fires a grappling hook forward and swings in mid-air, and this Skill's CD is decreased by 60%. This skill can be Held to release. When it is Held, Kinich can aim the grappling hook. Nightsoul's Blessing: Kinich Kinich's Nightsoul's Blessing lasts 10s and generates 2 Nightsoul points every second. In this state, Kinich will hook onto a nearby opponent and perform a variable attack: ·When using a Normal Attack, Kinich will fire Loop Shots as he loops around the grappled target based on his current movement direction, dealing Nightsoul-aligned Dendro DMG and generating 3 Nightsoul points. Loop Shot DMG is considered Elemental Skill DMG. ·When Nightsoul points are at max, he can use the Elemental Skill \"Scalespiker Cannon\": Consume all Nightsoul points to deal Nightsoul-aligned Dendro DMG. When \"Scalespiker Cannon\" is Held, Kinich can aim this shot. After firing the Cannon, Kinich will try to grapple to its target. ________________ While in Nightsoul's Blessing, after grappling an opponent or firing \"Scalespiker Cannon,\" a Blind Spot will be generated next to the opponent. When Kinich enters this Blind Spot, it will disappear and he will generate 4 Nightsoul points. If the grapple connection should snap due to exceeding the maximum distance or some other reason, using a Normal Attack will establish a new connection with a nearby opponent before performing Loop Shots.",
    "elemental_burst": " Hail to the Almighty Dragonlord Unleashes the power of the Almighty Dragonlord, K'uhul Ajaw (on a limited, conditional, restricted, contractual, partial, temporary basis), dealing Nightsoul-aligned AoE Dendro DMG. Ajaw will unleash his Dragon Breath at intervals, dealing Nightsoul-aligned AoE Dendro DMG. If Kinich is in Nightsoul's Blessing when this is used, this Blessing's duration is extended by 1.7s.",
    "passive_talent_1": " The Price of Desolation When Kinich is in Nightsoul's Blessing state, opponents hit by his Elemental Skill will enter the Desolation state, and when affected by Burning or Burgeon reaction DMG, they will restore 7 Nightsoul points to him. Nightsoul points can be gained this way once every 0.8s. The Desolation state will persist until this instance of Kinich's Nightsoul's Blessing state ends.",
    "passive_talent_2": " Flame Spirit Pact After a nearby party member triggers a Nightsoul Burst, Kinich will gain 1 stack of Hunter's Experience that lasts 15s. Max 2 stacks. When Kinich uses Canopy Hunter: Riding High's Scalespiker Cannon, all stacks of Hunter's Experience will be consumed, with each stack consumed increasing the DMG dealt by this Cannon shot by 320% of Kinich's ATK."
  },
  "Kirara": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Tenacity of the Milleith",
      "piece_bonus": "2pc) + Vourukasha’s Glow",
      "description": ""
    },
    "elemental_skill": " Meow-teor Kick Leaps into the air with all the agility of a cat passing through the bushes, and thwacks her foes with a flying kick that deals AoE Dendro DMG while creating a Shield of Safe Transport. This will also briefly apply Dendro to Kirara. ________________ Hold Attack: Out of her desire to \"deliver within half a day\", Kirara deploys a Shield of Safe Transport identical to the one that can be created by pressing the skill. She will also curl up into a special express delivery box, entering the Urgent Neko Parcel state in order to move and fight more swiftly.",
    "elemental_burst": " Secret Art: Surprise Dispatch Smash opponents with a Special Delivery Package used for punishing parcel thieves, dealing AoE Dendro DMG. After the Special Delivery Package explodes, it will split up into many Cat Grass Cardamoms that will explode either upon contact with opponents or after a period of time, dealing AoE Dendro DMG.",
    "passive_talent_1": " Bewitching, Betwitching Tails When Kirara is in the Urgent Neko Parcel state of her Elemental Skill, each impact against an opponent will grant her a stack of Reinforced Packaging. This effect can be triggered once for each opponent hit every 0.5s. Max 3 stacks. When the Urgent Neko Parcel state ends, each stack of Reinforced Packaging will create 1 Shield of Safe Transport for Kirara. The shields that are created this way will have 20% of the DMG absorption that the Shield of Safe Transport produced by Meow-teor Kick would have. If Kirara is already protected by a Shield of Safe Transport created by Meow-teor Kick, its DMG absorption will stack with these shields and its duration will reset.",
    "passive_talent_2": " Pupillary Variance Every 1,000 Max HP Kirara possesses will increase the DMG dealt by Meow-teor Kick by 0.4%, and the DMG dealt by Secret Art: Surprise Dispatch by 0.3%."
  },
  "Klee": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Crimson witch of flames",
      "piece_bonus": "4pc) Increases Overloaded, Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Jumpy Dumpty Jumpy Dumpty is tons of boom-bang-fun! When thrown, Jumpy Dumpty bounces thrice, igniting and dealing AoE Pyro DMG with every bounce. On the third bounce, the bomb splits into many mines. The mines will explode upon contact with enemies, or after a short period of time, dealing AoE Pyro DMG. Starts with 2 charges.",
    "elemental_burst": " Sparks 'n' Splash Klee's Blazing Delight! For the duration of this ability, continuously summons Sparks 'n' Splash to attack nearby enemies, dealing AoE Pyro DMG.",
    "passive_talent_1": " Pounding Surprise When Jumpy Dumpty and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG.",
    "passive_talent_2": " Sparkling Burst When Klee's Charged Attack results in a CRIT, all party members gain 2 Elemental Energy."
  },
  "Sanganomiya Kokomi": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Tenacity of the Millelith",
      "piece_bonus": "4pc) When an Elemental Skill hits an opponent, the ATK of all nearby party members is increased by 20% and their Shield Strength is increased by 30% for 3s. This effect can be triggered once every 0.5s. This effect can still be triggered even when the character who is using this artifact set is not on the field.",
      "description": ""
    },
    "elemental_skill": " Kurage's Oath Summons a \"bake-kurage\" created from water that can heal her allies. Using this skill will apply the Wet status to Sangonomiya Kokomi. ________________ Bake-Kurage Deals Hydro DMG to surrounding opponents and heal nearby active characters at fixed intervals. This healing is based on Kokomi's Max HP.",
    "elemental_burst": " Nereid's Ascension The might of Watatsumi descends, dealing Hydro DMG to surrounding opponents, before robing Kokomi in a Ceremonial Garment made from the flowing waters of Sangonomiya. ________________ Ceremonial Garment • Sangonomiya Kokomi's Normal Attack, Charged Attack, and Bake-Kurage DMG are increased based on her Max HP. • When her Normal and Charged Attacks hit opponents, Kokomi will restore HP for all nearby party members, and the amount restored is based on her Max HP. • Increases Sangonomiya Kokomi's resistance to interruption and allows her to walk on the water's surface. These effects will be cleared once Sangonomiya Kokomi leaves the field.",
    "passive_talent_1": " Tamanooya's Casket If Sangonomiya Kokomi's own Bake-Kurage are on the field when she uses Nereid's Ascension, the Bake-Kurage's duration will be refreshed.",
    "passive_talent_2": " Song of Pearls While donning the Ceremonial Garment created by Nereid's Ascension, the Normal and Charged Attack DMG Bonus Sangonomiya Kokomi gains based on her Max HP will receive a further increase based on 15% of her Healing Bonus."
  },
  "Layla": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Tenacity of the Millelith",
      "piece_bonus": "4pc) When an Elemental Skill hits an opponent, the ATK of all nearby party members is increased by 20% and their Shield Strength is increased by 30% for 3s. This effect can be triggered once every 0.5s. This effect can still be triggered even when the character who is using this artifact set is not on the field.",
      "description": ""
    },
    "elemental_skill": "Layla's Elemental Skill provides her a shield that builds 1 charge every 1.5 seconds or 2 charges every time a character uses an Elemental Skill. Once 4 charges have been built up, the shield will send out a Shooting Star that will deal Cryo DMG to nearby enemies. This effect will end if her shield breaks, so you have to also balance not getting hit too much with the shield.",
    "elemental_burst": "Layla unleashes a Dream Sphere that constantly fires starlight slugs at opponents within its AoE. It also generates night stars for Layla's shield!",
    "passive_talent_1": " Like Nascent Light While the Curtain of Slumber is active, the Deep Sleep effect will activate each time the Curtain gains 1 Night Star: ·The Shield Strength of a character under the effect of the Curtain of Slumber increases by 6%. ·This effect can have a maximum of 4 stacks and persists until the Curtain of Slumber disappears",
    "passive_talent_2": " Sweet Slumber Undisturbed The DMG dealt by the Shooting Stars fired by Nights of Formal Focus is increased by 1.5% of Layla's Max HP."
  },
  "Lisa": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": " Violet Arc Channels the power of lightning to sweep bothersome matters away. ________________ Hold Attack: After an extended casting time, calls down lightning from the heavens, dealing massive Electro DMG to all nearby enemies. Deals great amounts of extra damage to enemies based on the number of Shock stacks applied to them, and clears their Conductive status. ________________ Press Releases a homing Lightning Orb. On hit, it deals Electro DMG, and applies a stack of the Conductive status (Max 3 stacks) to enemies in a small AoE.",
    "elemental_burst": " Lightning Rose Summons a Lightning Rose that unleashes powerful lightning bolts, launching surrounding enemies and dealing Electro DMG. The Lightning Rose will continuously emit lightning to knock back enemies and deal Electro DMG for so long as it persists.",
    "passive_talent_1": " Induced Aftershock Hits by charged Attacks apply Violet Arc's Shocked status to enemies.",
    "passive_talent_2": " Static Electricity Field Enemies hit by Lightning Rose have their DEF decreased by 15% for 10s."
  },
  "Lynette": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Enigmatic Feint Flicks her mantle and executes an Enigmathrust, dealing Anemo DMG. When the Enigma Thrust hits an opponent, it will restore Lynette's HP based on her Max HP and in the 4s afterward, she will lose a certain amount of HP per second. Based on whether you tap or hold this ability, she will use Enigma Thrust differently. Tap She swiftly uses an Enigma Thrust. ________________ Hold Attack: Lynette will enter a Pilfering Shadow state and apply Shadowsign to a nearby opponent. You can control her movement during this state and you can end it prematurely by using this skill again. When this high-speed state ends, Lynette will unleash her Enigma Thrust. ________________ If there is an opponent with Shadowsign applied, Lynette will approach them in a flash before using Enigma Thrust. A Maximum of 1 opponent can have Shadowsign at a time and will be canceled if Lynette is too far from the opponent. Arkhe: Ousia At specific intervals, Lynette will unleash a Surging Blade when she uses an Enigma Thrust, dealing Ousia-aligned Anemo DMG.",
    "elemental_burst": " Magic Trick: Astonishing Shift Lynette raises her mantle high, dealing AoE Anemo DMG, using skillful sleight of hand to make a giant Bogglecat Box appear! ________________ Bogglecat Box • Taunts nearby opponents, attracting their attacks. • Deals Anemo DMG to nearby opponents at intervals. • When the Bogglecat Box comes into contact with Hydro/Pyro/Cryo/Electro, it will gain the corresponding element and additionally fire Vivid Shots that will deal DMG from that element at intervals. Elemental Absorption of this kind will only occur once during this ability's duration.",
    "passive_talent_1": " Sophisticated Synergy Within 10s after using Magic Trick: Astonishing Shift, when there are 1/2/3/4 Elemental Types in the party, all party members' ATK will be increased by 8%/12%/16%/20% respectively. When running Lynette with Virisdescent Venerer, this ensures that on top of shredding the Elemental RES off enemies with the absorbed element, Lynette herself provides more off-field damage.",
    "passive_talent_2": " Props Positively Prepped After the Bogglecat Box summoned by Magic Trick: Astonishing Shift performs Elemental Conversion, Lynette's Elemental Burst will deal 15% more DMG. This effect will persist until the Bogglecat Box's duration ends."
  },
  "Lyney": {
    "talent_priority": [
      "normal attack",
      "elemental skill",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Marechaussee Hunter",
      "piece_bonus": "4pc) When current HP increases or decreases, CRIT Rate will be increased by 12% for 5s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Bewildering Lights Lyney does a flourish with his hat, unleashing fireworks of surprise, clearing all current Prop Surplus Stack and dealing AoE Pyro DMG. The damage increases according to the stacks cleared and regenerates Lyney's HP based on his Max HP. When a Grin-Malkin Hat created by Lyney is on the field, using this skill will cause it to explode and deal AoE Pyro DMG and is considered Charged Attack DMG.",
    "elemental_burst": " Wondrous Trick: Miracle Parade Lyney turns into a Grin-Malkin Cat that can move around quickly. ________________ When the Grin-Malkin Cat nears opponents, it will send flames falling down on them, dealing one instance of Pyro DMG to each opponent. When the Grin-Malkin Cat's duration ends or is cancelled, it will be dismissed in a wave of fireworks that deal AoE Pyro DMG, summons 1 Grin-Malkin Hat, and creates 1 Prop Surplus Stack.",
    "passive_talent_1": " Perilous Performance If Lyney consumes HP when firing off a Prop Arrow, the Grin-Malkin Hat summoned will, upon hitting an opponent, restore 3 Energy to Lyney and increase DMG dealt by 80% of his ATK. With this Passive, Lyney does not have to build much energy recharge due to this skill and also due to him usually being run in a Mono-Pyro team.",
    "passive_talent_2": " Conclusive Ovation The DMG Lyney deals to opponents affected by Pyro will receive the following buffs: • Increase DMG dealt by 60%. • Each Pyro party member other than Lyney will cause the DMG dealt to increase by an additional 20%. Lyney can deal up to 100% increased DMG to opponents affected by Pyro in this way."
  },
  "Mavuika": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attacks"
    ],
    "best_artifact_set": {
      "name": "Obsidian Codex",
      "piece_bonus": "4pc) After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.",
      "description": ""
    },
    "elemental_skill": " The Named Moment Calling upon her authority over \"conflict,\" Mavuika summons the All-Fire Armaments passed down through the line of human Archons, dealing Nightsoul-aligned Pyro DMG. After using this, Mavuika's Nightsoul points are restored to max value, and she enters the Nightsoul's Blessing state. Has different forms when Tapped or Held. ________________ Tap Divine Name Unleashed: The All-Fire Armaments manifest as a Ring of Searing Radiance. The Ring follows the current active character and attacks nearby opponents at intervals, dealing Nightsoul-aligned Pyro DMG. Hold \"Ancient Name Unbound\": Mavuika can ride the Flamestrider to temporarily cross various terrain types and glide in mid-air. Mavuika's Normal, Charged, and Plunging Attacks will also be converted to deal Nightsoul-aligned Pyro DMG which cannot be overridden. When sprinting, she also deals Pyro DMG to opponents along her path.",
    "elemental_burst": " Hour of Burning Skies Mavuika's Elemental Burst is not reliant on Energy, but instead, on \"Fighting Spirit.\" Fighting Spirit When Mavuika has at least 50% Fighting Spirit, she can consume it all to unleash her Elemental Burst. Mavuika can obtain Fighting Spirit via the following methods: · When in combat, Nightsoul points consumed by nearby party members are converted to Fighting Spirit. · When nearby party members' Normal Attacks hit opponents, Mavuika gains 1.5 Fighting Spirit. This can trigger once every 0.1s. After using this, Mavuika gains 10 Nightsoul points and enters the Nightsoul's Blessing state. Riding her Flamestrider high in the air, she uses a powerful Sunfell Slice against opponents on the ground, dealing Nightsoul-aligned AoE Pyro DMG and entering the \"Crucible of Death and Life\" state. ________________ Crucible of Death and Life During this time, Mavuika's various actions will no longer consume Nightsoul points, and her interruption resistance is increased. Also, the DMG dealt by Sunfell Slice and \"Ancient Name Unbound\"'s Normal and Charged Attacks is increased based on the amount of Fighting Spirit she has when using the Elemental Burst. Unlike most characters in the game, her Elemental Burst relies on an energy called Fighting Spirit which is gained by your party members either consuming Nightsoul points or using Normal Attacks. This makes Mavuika especially good with Natlan characters.",
    "passive_talent_1": " Gift of Flaming Flowers When a nearby party member triggers a Nightsoul Burst, Mavuika's ATK increases by 30% for 10s.",
    "passive_talent_2": " \"Kiongozi\" After using her Elemental Burst, Hour of Burning Skies, every point of Fighting Spirit present when it is used increases the DMG that the current active party member deals by 0.2%. The maximum increase obtainable this way is 40%, and this effect lasts 20s, decaying over this duration until it reaches 0."
  },
  "Mika": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Talent Description Mika uses his crossbow to attack, granting all nearby characters in your party Soulwind. When characters in the Soulwind state are on the field, their ATK SPD will be increased. Press: Fires a Flowfrost Arrow that can pierce through opponents, dealing Cryo DMG to enemies it comes into contact with. Hold: Goes into Aiming Mode, locking on to an opponent and firing a Rimestar Flare at them, dealing Cryo DMG. When the Rimestar Flare hits, it will rise before exploding, launching Rimestar Shards into a maximum of 3 other opponents, dealing Cryo DMG.",
    "elemental_burst": " Talent Description Derives the ability to spur his teammates on from the recited prayers of the knightly order, regenerating HP for all nearby party members. This healing is based on Mika's Max HP and will grant them the Eagleplume state. Eagleplume When the Normal Attacks of active characters affected by Eagleplume hit an opponent, Mika will help them regenerate HP based on his Max HP. Characters affected by this state can only regenerate HP in this way once per short interval of time.",
    "passive_talent_1": " Talent Description Per the following circumstances, the Soulwind state caused by Starfrost Swirl will grant characters the Detector effect, increasing their Physical DMG by 10% when they are on the field. - If the Flowfrost Arrow hits more than one opponent, each additional opponent hit will generate 1 Detector stack - When a Rimestar Shard hits an opponent, it will generate 1 Detector stack. Each Rimestar Shard can trigger the effect 1 time. The Soulwind state can have a maximum of 3 Detector stacks, and if Starfrost Swirl is cast again during this duration, the pre-existing Soulwind state and all its Detector stacks will be cleared.",
    "passive_talent_2": " Talent Description When an active character affected by both Skyfeather Song's Eagleplume and Starfrost Swirl's Soulwind at once scores a CRIT Hit with their attacks, Soulwind will grant them 1 stack of Detector from Suppressive Barrage. During a single instance of Soulwind, 1 Detector stack can be gained in this manner. Additionally, the maximum number of stacks that can be gained through Soulwind alone is increased by 1. Requires Suppressive Barrage to be unlocked first."
  },
  "Mona": {
    "talent_priority": [
      "elemental burst",
      "normal attack",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": " Mirror Reflection of Doom Creates an illusory Phantom of fate from coalesced waterspouts. The Phantom has the following special properties: ・Continuously taunts nearby enemies, attracting their fire. ・Continuously deals Hydro DMG to nearby enemies. ・When its duration expires, the Phantom explodes, dealing AoE Hydro DMG. ________________ Hold Attack: Utilizes water currents to move backwards swiftly before conjuring a Phantom. Only on Phantom created by Mirror Reflection of Doom can exist at any time.",
    "elemental_burst": " Stellaris Phantasm Mona summons the sparkling waves and creates a reflection of the starry sky, applying the Illusory Bubble status to opponents in a large AoE. ________________ Illusory Bubble Traps opponents inside a pocket of destiny and also makes them Wet. Renders opponents immobile. When an opponent affected by Illusory Bubble sustains DMG, the following effects are produced: ・Applies Omen to the opponent, which gives a DMG Bonus, also increasing the DMG of the attack that causes it. ・Removes the Illusory Bubble, dealing Hydro Elemental DMG in the process. The DMG Bonus does not apply to the Hydro Elemental DMG dealt in this instance. Mona's key focus is her ability to drastically amplify Elemental DMG with her Elemental Burst, Stellaris Phantasm. Mona's ability places a debuff bubble on enemies that not only amplifies the damage dealt to them but also deals an explosion of Hydro damage when the bubble is popped. Using the Hydro explosion to trigger Melt or Vaporize will deal massive amounts of damage.",
    "passive_talent_1": " Come 'n' Get Me, Hag! After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom. A Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom.",
    "passive_talent_2": " Waterborne Destiny Increases Mona's Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate."
  },
  "Mualani": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Obsidian codex",
      "piece_bonus": "4pc) After the equipping character consumes 1 Nightsoul point while on the field, CRIT Rate increases by 40% for 6s. This effect can trigger once every second.",
      "description": ""
    },
    "elemental_skill": " Surfshark Wavebreaker Combining her mastery of speed and the waves and water, Mualani can surf anytime, anywhere. After using this skill, Mualani will gain 60 Nightsoul points and enter the Nightsoul's Blessing state. ________________ Nightsoul's Blessing: Mualani Constantly consume Nightsoul points. When they are depleted or the skill is used again, Mualani's Nightsoul's Blessing will end. • Mualani mounts her Sharky Surfboard, increasing her Movement SPD and interruption resistance. • Normal Attacks are converted to Sharky's Bites, dealing Nightsoul-aligned Hydro DMG based on her Max HP. • When Mualani makes contact with opponents, she applies \"Marked as Prey\" and gains 1 Wave Momentum stack. Waved Momentum and Marked as Prey When Mualani uses Sharky's Bite, her DMG dealt increases based on Wave Momentum stacks. When she has 3 stacks, Sharky's Bite will be converted to Sharky's Surging Bite, further increasing her DMG and removing all her stacks when hitting an opponent.",
    "elemental_burst": " Boomsharka-laka Fires a Super Shark Missile that can track opponents, dealing Nightsoul-aligned AoE Hydro DMG based on Mualani's Max HP. Mualani's Elemental Burst summons her shark to shoot towards her opponents, exploding for large damage in an AoE. Her Elemental Burst is a form of Burst Damage to close out or open her damage rotations",
    "passive_talent_1": " Heat-Resistant Freshwater Puffer When Sharky's Surging Bite hits an opponent, a generated nearby. Puffer will be Mualani will restore 20 Nightsoul points when she picks up a Puffer. Only 2 such Puffers can be created in this way during a single instance of being in Nightsoul's Blessing.",
    "passive_talent_2": " Natlan's Greatest Guide After a nearby party member triggers a Nightsoul Burst, Mualani will gain 1 stack of Wavechaser's Exploits, which lasts for 20s. Max 3 stacks. When she uses Boomsharka-laka, Mualani will clear all Wavechaser's Exploits stacks and increase the DMG of this Boomsharka-laka by 15%/30%/45% of her Max HP based on the number of stacks cleared."
  },
  "Nahida": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Deepwood memories",
      "piece_bonus": "4pc) After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field.",
      "description": ""
    },
    "elemental_skill": " All Schemes to Know Sends forth karmic bonds of wood and tree from her side, dealing AoE Dendro DMG and marking up to 8 opponents hit with the Seed of Skandha. When held, this skill will trigger differently. ________________ Hold Enters Aiming Mode, which will allow you to select a limited number of opponents within a limited area. During this time, Nahida's RES to interruption will be increased. When released, deals Dendro DMG to these opponents and marks them with the Seed of Skandha. Aiming Mode will last up to 5s and can select a max. of 8 opponents. Seeds of Skandha Opponents marked by the Seed of Skandha will be linked to one another up till a certain distance. After you trigger Elemental Reactions on affected enemies or when they take DMG from Dendro Cores (including Burgeon and Hyperbloom DMG), Nahida will unleash Tri-Karma Purification on opponents and all connected opponents, dealing Dendro DMG based on her ATK and Elemental Mastery. You can trigger 1 Tri-Karma Purification in a short period of time.",
    "elemental_burst": " Illusory Heart Manifests the Court of Dreams and expands the Shrine of Maya. ________________ Shrine of Maya When the Shrine of Maya field is unleashed, the following effects will be separately unleashed based on the Elemental Types present within the party: • Pyro: While Nahida remains within the Shrine of Maya, the DMG dealt by Tri-Karma Purification is increased. • Electro: While Nahida remains within the Shrine of Maya, the interval between each Tri-Karma Purification is decreased. • Hydro: The Shrine of Maya's duration is increased. If there are at least 2 party members of the aforementioned Elemental Types present when the field is deployed, the aforementioned effects will be increased further. Even if Nahida is not on the field, these bonuses will still take effect so long as party members are within the Shrine of Maya.",
    "passive_talent_1": " Compassion Illuminated When unleashing Illusory Heart, the Shrine of Maya will gain the following effects: ________________ The Elemental Mastery of the active character within the field will be increased by 25% of the Elemental Mastery of the party member with the highest Elemental Mastery. You can gain a maximum of 250 Elemental Mastery in this manner.",
    "passive_talent_2": " Awakening Elucidated Each point of Nahida's Elemental Mastery beyond 200 will grant 0.1% Bonus DMG and 0.03% CRIT Rate to Tri-Karma Purification from All Schemes to Know. A maximum of 80% Bonus DMG and 24% CRIT Rate can be granted to Tri-Karma Purification in this manner."
  },
  "Navia": {
    "talent_priority": [
      "Elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Nighttime whispers in the echoing woods",
      "piece_bonus": "4pc) After using an Elemental Skill, gain a 20% Geo DMG Bonus for 10s. While under a shield granted by the Crystallize reaction, the above effect will be increased by 150%, and this additional increase disappears 1s after that shield is lost.",
      "description": ""
    },
    "elemental_skill": " Ceremonial Crystalshot When she fires, Navia will consume all Crystal Shrapnel stacks and open her elegant yet lethal Gunbrella, firing multiple Rosula Shardshots that can penetrate opponents, dealing Geo DMG to opponents hit. When 0/1/2/3 or more stacks of Crystal Shrapnel are consumed, 5/7/9/11 Rosula Shardshots that strike a single opponent, the greater the DMG dealt to them. When all 11 Rosula Shardshots strike, 200% of the original amount of DMG is dealt. In addition, when more than 3 stacks of Crystal Shrapnel are consumed, every stack consume beyond those 3 will increase the damage dealt by this Gunbrella attack by an additional 15%. ________________ Hold Attack: Enter Aiming Mode, continually collecting Elemental Shards created by Crystallize reactions. When released, fire Rosula Shardshots with the same effect as when the skill is Tapped. Arkhe: Ousia Periodically, when Navia fires her Gunbrella, a Surging Blade will be summoned, dealing Ousia-aligned Geo DMG.",
    "elemental_burst": " As the Sunlit Sky's Singing Salute On the orders of the President of the Spina di Rosula, call for a magnificient Rosula Dorata Salute. Unleashes a massive cannon bombardment on opponents in front of her, dealing AoE Geo DMG and providing Cannon Fire Support for a duration afterward, periodically dealing Geo DMG to nearby opponents. When cannon atacks from Rosula Dorata Salute hits opponents, Navia will gain 1 stack of Crystal Shrapnel. This effect can be trigger up to once every 2.4s. Her Elemental Burst summons cannon bombardments that periodically target enemies with Geo DMG. This also allows her to get Crystal Shrapnels while the burst is active.",
    "passive_talent_1": " Undisclosed Distribution Channels For 4s after using Ceremonial Crystalshot, the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Pllunging Attacks will be converted into Geo DMG which cannot be overridden by other Elemental infusions, and the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be increased by 40%.",
    "passive_talent_2": " Mutual Assistance Network For each Pyro/Electro/Cryo/Hydro party member, Navia gains 20% increased ATK. This effect can stack up to 2 times. This passive talent makes Navia synergise well with other elements despite Geo only having the Crystallise reaction to work with."
  },
  "Neuvillette": {
    "talent_priority": [
      "Normal attack",
      "elemental skill",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Marechaussee Hunter",
      "piece_bonus": "4pc) When current HP increases or decreases, CRIT Rate will be increased by 12% for 5s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " O Tears, I Shall Repay Summons a Raging Waterfall that will deal AoE Hydro DMG to opponents in front of Neuvillette based on his Max HP. After hitting an opponent, this skill will generate 3 Sourcewater Droplets near that opponent.",
    "elemental_burst": " O Tides, I Have Returned Unleashes waves that will deal AoE Hydro DMG based on Neuvillette's Max HP. After a short interval, 2 waterfalls will descend and deal Hydro DMG in a somewhat smaller AoE, and will generate 6 Sourcewater Droplets within an area in front. Arkhe: Pneuma At certain intervals, when the Raging Waterfall descends, a Spiritbreath Thorn will descend that pierces opponents, dealing Pneuma-aligned Hydro DMG.",
    "passive_talent_1": " Heir to the Ancient Sea's Authority When a party member triggers a Vaporize, Frozen, Electro-Charged, Bloom, Hydro Swirl, or a Hydro Crystallize reaction on opponents, 1 stack of Past Draconic Glories will be granted to Neuvillette for 30s. Max 3 stacks. Past Draconic Glories causes Charged Attack: Equitable Judgment to deal 110%/125%/160% of its original DMG. The stacks of Past Draconic Glories created by each kind of Elemental Reaction exist independently.",
    "passive_talent_2": " Discipline of the Supreme Arbitration For each 1% of Neuvillette's current HP greater than 30% of Max HP, he will gain 0.6% Hydro DMG Bonus. A maximum bonus of 30% can be obtained this way."
  },
  "Nilou": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Tenacity of the Millelith",
      "piece_bonus": "2pc): HP+20% Vourukasha's Glow",
      "description": ""
    },
    "elemental_skill": " Dance of Haftkarsvar Enters the Pirouette state, dealing Hydro DMG to nearby opponents based on Nilou's Max HP. While she is in the Pirouette state, Nilou's Normal Attacks and Elemental Skill will cause her to enter the Sword Dance and Whirling Steps stances respectively, causing DMG she deals to be converted to Hydro DMG that cannot be overridden and that is considered Elemental Skill DMG. In these stances, Nilou's third dance step will end Pirouette, and has the following effects based on the type of said dance step: - Sword Dance: unleashes a Luminous Illusion that deals Hydro DMG to opponents and grants Nilou the Lunar Prayer effect. This effect converts Nilou's Normal Attacks into Sword Dance techniques, and her final hit will unleash a Luminous Illusion. - Whirling Steps: Nilou unleashes a Whirling Water Wheel that deals AoE Hydro DMG and creates a Tranquility Aura that follows your active character around and applies Wet to opponents within its AoE. Nilou is unable to perform Charged Attacks when under the effect of Pirouette or Lunar Prayer. These effects will be removed once she leaves the field.",
    "elemental_burst": " Dance of Abzendegi: Distant Dreams, Listening Spring Begins the dance of faraway dreams and springs that hear, causing a Lotus of Distant Waters to bloom, dealing AoE Hydro DMG based on Nilou's Max HP and applying the Lingering Aeon effect to all opponents hit. After an interval, opponents affected by Lingering Aeon will take Hydro DMG.",
    "passive_talent_1": " Court of Dancing Petals When all characters in the party are all Dendro or Hydro, and there are at least one Dendro character and one Hydro character: The completion of the third dance step of Nilou's Dance of Haftkarsvar will grant all nearby characters the Golden Chalice's Bounty for 30s upon its completion. Characters under the effect of Golden Chalice's Bounty will increase the Elemental Mastery of all nearby characters by 100 for 10s whenever they are hit by Dendro attacks. Also, triggering the Bloom reaction will create Bountiful Cores instead of Dendro Cores. Such Cores will burst very quickly after being created, and they have larger AoEs. Bountiful Cores cannot trigger Hyperbloom or Burgeon, and they share an upper numerical limit with Dendro Cores. Bountiful Core DMG is considered DMG dealt by Dendro Cores produced by Bloom. Should the party not meet the conditions for this Passive Talent, any existing Golden Chalice's Bounty effects will be canceled.",
    "passive_talent_2": " Dreamy Dance of Aeons Every 1,000 points of Nilou's Max HP above 30,000 will cause the DMG dealt by Bountiful Cores created by characters affected by Golden Chalice's Bounty to increase by 9%. The maximum increase in Bountiful Core DMG that can be achieved this way is 400%."
  },
  "Ningguang": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Nighttime whispers in the echoing woods",
      "piece_bonus": "4pc) After using an Elemental Skill, gain a 20% Geo DMG Bonus for 10s. While under a shield granted by the Crystallize reaction, the above effect will be increased by 150%, and this additional increase disappears 1s after that shield is lost.",
      "description": ""
    },
    "elemental_skill": " Jade Screen Ningguang creates a Jade Screen out of gold, obsidian and her great opulence, dealing AoE Geo DMG. Jade Screen ・Blocks enemy projectiles ・Endurance scales based on Ningguang's Max HP Jade Screen is considered a Geo Construct and can be used to block certain attacks, but cannot be climbed. Only one Jade Screen may exist at any one time.",
    "elemental_burst": " Starshatter Gathering a great number of gems, Ningguang scatters them all at once, sending homing projectiles at her enemies that deal massive Geo DMG. If Starshatter is cast when a Jade Screen is nearby, the Jade Screen will fire additional gem projectiles at the same time.",
    "passive_talent_1": " Backup Plan When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina.",
    "passive_talent_2": " Strategic Reserve A character that passes through the Jade Screen will gain a 12% Geo DMG Bonus for 10s."
  },
  "Noelle": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "husk of opulent dreams",
      "piece_bonus": "4pc) A character equipped with this Artifact set will obtain the Curiosity effect in the following conditions: When on the field, the character gains 1 stack after hitting an opponent with a Geo attack, triggering a maximum of once every 0.3s. When off the field, the character gains 1 stack every 3s. Curiosity can stack up to 4 times, each providing 6% DEF and a 6% Geo DMG Bonus. When 6 seconds pass without gaining a Curiosity stack, 1 stack is lost.",
      "description": ""
    },
    "elemental_skill": " Breastplate Summons protective stone armor, dealing Geo DMG to surrounding enemies and creating a shield. The shield's DMG Absorption scales based on Noelle's DEF. The shield has the following properties: ・When Noelle's Normal and Charged Attacks hit a target, they have a certain chance to regenerate HP for all characters. ・Possesses 250% Absorption Efficiency against Geo DMG. The amount of HP healed when regeneration is triggered scales based on Noelle's DEF.",
    "elemental_burst": " Sweeping Time Gathering the strength of stone around her weapon, Noelle strikes the enemies surrounding her within a large AoE, dealing Geo DMG. Afterwards, Noelle gains the following effects: ・Larger attack AoE. ・Converts attack DMG to Geo DMG that cannot be overridden by any other elemental infusion. ・Increased ATK that scales based on her DEF.",
    "passive_talent_1": " Devotion When Noelle is in the party but not on the field, this ability triggers automatically when the active character's HP falls below 30%: Creates a shield for your active character that lasts for 20s and absorbs DMG equal to 400% of Noelle's DEF. This effect can only occur once every 60s.",
    "passive_talent_2": " Nice and Clean Noelle will decrease the CD of Breastplate by 1s for every 4 Normal or Charged Attack hits she scores on opponents. One hit may be counted every 0.1s."
  },
  "Ororon": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "scroll of the hero of cinder city",
      "piece_bonus": "4pc) After the equipping character triggers a reaction, all nearby party members gain a 12% Elemental DMG Bonus for the involved Elemental Types for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all party members gain an additional 28% Elemental DMG bonus for the Elemental Types involved in the reaction for 20s.",
      "description": ""
    },
    "elemental_skill": " Night's Sling Ororon manifests an ancient mystical technique from the Masters of the Night-Wind as a Spirit Orb of midnight shade and throws it at his foe, dealing Nightsoul-aligned Electro DMG. When other opponents are nearby, the Spirit Orb will bounce between them, dealing Nightsoul-aligned Electro DMG. Each time Night's Sling is used, each opponent can only be selected as a target once. After 3 bounces, or if there are no eligible targets left, the Orb will disappear.",
    "elemental_burst": " Dark Voices Echo Ororon works an ancient ritual, dealing Nightsoul-aligned AoE Electro DMG, summoning forth a Supersonic Oculus. ________________ Supersonic Oculus: Continuously taunts nearby opponents and attracts attacks from them. Continously rotates and fires off sonic waves that deal Nightsoul-aligned Electro DMG.",
    "passive_talent_1": " Nightshade Synesthesia After a nearby party member triggers a Nightsoul Burst, Ororon will gain 40 Nightsoul Points. Within 15s after using his Elemental Skill, when other party members' Hydro or Electro attacks hit opponents, Ororon will gain 5 Nightsoul Points, an effect that can occur every 0.3s for a maximum of 10 times during this 15s duration. Ororon can have a maximum of 80 Nightsoul Points. ________________ Also, when nearby opponents take Electro-Charged reaction DMG or Nightsoul-aligned DMG dealt by other nearby characters, Ororon will consume 10 Nightsoul Points (provided he has at least that amount), entering the Nightsoul's Blessing state and triggering the Hypersense effect: Deal Nightsoul-aligned Electro DMG based 160% of Ororon's ATK to at most 4 nearby opponents. The aforementioned effect can trigger once every 1.8s. Nightsoul's Blessing: Ororon Ororon's Nightsoul's Blessing state lasts 6s.",
    "passive_talent_2": " Aspect Catalyst After the Elemental Skill Night's Sling's Spirit Orb hits an opponent, Ororon will gain the Aspect Sigil effect for 15s. ________________ Aspect Sigil When a nearby active party member hits an opponent with Normal, Charged, or Plunging Attacks, that character will restore 3 Energy. If Ororon is off-field, Ororon will also restore 3 Energy. This effect can trigger once every 1s, and can trigger 3 times per duration."
  },
  "Qiqi": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "tenacity of the millelith",
      "piece_bonus": "4pc) When an Elemental Skill hits an opponent, the ATK of all nearby party members is increased by 20% and their Shield Strength is increased by 30% for 3s. This effect can be triggered once every 0.5s. This effect can still be triggered even when the character who is using this artifact set is not on the field.",
      "description": ""
    },
    "elemental_skill": " Adeptus Art: Herald of Frost Using the Icevein Talisman, Qiqi brings forth the Herald of Frost, dealing Cryo DMG to nearby enemies. ________________ Herald of Frost ・When Qiqi hits a target with her Normal or Charged Attacks, she regenerates HP for your characters in the party and all nearby allied characters. ・Regenerates a certain amount of HP at regular intervals for your active character. ・Follows the character around, dealing Cryo DMG to enemies in its path.",
    "elemental_burst": " Adeptus Art: Preserver of Fortune Qiqi releases the adeptus power sealed within her body, marking nearby enemies with a Fortune-Preserving Talisman that deals Cryo DMG. ________________ Fortune-Preserving Talisman When enemies affected by this Talisman takes DMG, the character that dealt this DMG regenerates HP",
    "passive_talent_1": " Life-Prolonging Methods When a character under the effects of Adeptus Art: Herald of Frost triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s.",
    "passive_talent_2": " A Glimpse into Arcanum When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur every 30s."
  },
  "Raiden Shogun": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": " Transcendence: Baleful Omen The Raiden Shogun unveils a shard of her Euthymia, dealing Electro DMG to nearby opponents, and granting nearby party members the Eye of Stormy Judgment. ________________ Eye of Stormy Judgement When characters with this buff attack deal DMG to opponents, the Eye will unleash a coordinated attack, dealing AoE Electro DMG at the opponent's position. Characters who gain the Eye of Stormy Judgment will have their Elemental Burst DMG increased based on the Energy Cost of the Elemental Burst during the Eye's duration. ・The Eye can initiate 1 coordinated attack every 0.9s per party. ・Coordinated attacks generated by characters not controlled by you deal 20% of the normal DMG.",
    "elemental_burst": " Secret Art: Musou Shinsetsu The Raiden Shogun unleashes the Musou no Hitotachi and deals AoE Electro DMG, using Musou Isshin in combat for a certain duration afterward. The DMG dealt by Musou no Hitotachi and Musou Isshin's attacks will be increased based on the number of Chakra Desiderata's Resolve stacks consumed when the skill is used. ________________ Musou Isshin While in this state, the Raiden Shogun's Normal, Charged, and Plunging ATKs are infused with Electro, which cannot be overriden. When her attacks hit opponents, she regenerates Energy for nearby party members. Energy can be restored this way once every 1s, and this effect can be triggered 5 times throughout the skill's duration. Chakra Desiderata When nearby party members (excluding the Raiden Shogun herself) use their Elemental Bursts, the Raiden Shogun will build up Resolve stacks based on the Energy Cost of these Elemental Bursts. The maximum number of Resolve stacks is 60. The Resolve gained by Chakra Desiderata will be cleared 300s after the Raiden Shogun leaves the field.",
    "passive_talent_1": " Wishes Unnumbered When nearby party members gain Elemental Orbs or Particles, Chakra Desiderata gains 2 Resolve Stacks. This effect can occur once every 3s.",
    "passive_talent_2": " Enlighted One Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her: ・0.6% greater Energy restoration from Musou Isshin. ・0.4% Electro DMG Bonus."
  },
  "Razor": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "pale flame",
      "piece_bonus": "4pc) When an Elemental skill hits an opponent, ATK is increased by 9% for 7s. This effect stacks up to 2 times and can be triggered once every 0.3s. Once 2 stacks are reached, 2-set effect is doubled.",
      "description": ""
    },
    "elemental_skill": " Claw and Thunder Swings the Thunder Wolf Claw, dealing Electro DMG to enemies in front of Razor. Upon striking an enemy, Razor will gain an Electro Sigil, which increases his Energy Recharge rate. Razor can have up to 3 Electro Sigils simultaneously, and gaining a new Electro Sigil refreshes their duration. ________________ Hold Attack: Gathers Electro energy to unleash a lightning storm over a small AoE, causing massive Electro DMG, and clears all of Razor's Electro Sigils. Each Electro Sigil cleared in this manner will be converted into Energy for Razor.",
    "elemental_burst": " Lightning Fang Summons the Wolf Within which deals Electro DMG to all nearby opponents. This clears all of Razor's Electro Sigils, which will be converted into elemental energy for him. The Wolf Within will fight alongside Razor for the skill's duration. ________________ The Wolf Within ・Strikes alongside Razor's normal attacks, dealing Electro DMG. ・Raises Razor's ATK SPD and Electro RES. ・Causes Razor to be immune to DMG inflicted by the Electro-Charged status. ・Disables Razor's Charged Attacks. ・Increases Razor's resistance to interruption. These effects end when Razor leaves the battlefield. When Razor leaves the field, a maximum of 10 Energy will be returned to him based off the duration remaining on this skill.",
    "passive_talent_1": " Awakening Decreases Claw and Thunder's CD by 18%. Using Lightning Fang resets the CD of Claw and Thunder.",
    "passive_talent_2": " Hunger When Razor's Energy is below 50%, increases Energy Recharge by 30%."
  },
  "Rosaria": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "blizzard strayer",
      "piece_bonus": "4pc) When a character attacks an enemy affected by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%.",
      "description": ""
    },
    "elemental_skill": " Ravaging Confession Rosaria swiftly shifts herself behind the opponent, then pierces and slashes the enemy with her polearm, dealing Cryo DMG. Rosaria cannot use this ability to move behind larger enemies.",
    "elemental_burst": " Rites of Termination Rosaria's unique take on this prayer ritual. First, she swings her weapon to slash surrounding enemies; then she summons a frigid Ice Lance that strikes the ground. Both actions deal Cryo DMG. While active, the Ice Lance periodically releases a blast of cold air, dealing Cryo DMG to surrounding enemies.",
    "passive_talent_1": " Regina Probationum When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s.",
    "passive_talent_2": " Shadow Samaritan Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s. CRIT Rate Bonus gained this way cannot exceed 15%."
  },
  "Kujou Sara": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Tengu Stormcall Retreats rapidly with the speed of a tengu, summoning the protection of the Crowfeather. Gains Crowfeather Cover for 18s, and when Kujou Sara fires a fully-charged Aimed Shot, Crowfeather Cover will be consumed, and will leave a Crowfeather at the target location. ________________ ・Crowfeathers will trigger Tengu Juurai: Ambush after a short time, dealing Electro DMG & granting the active character within its AoE an ATK Bonus based on Kujou Sara's Base ATK. ・ The ATK Bonuses from different Tengu Juurai will not stack, & their effects and duration will be determined by the last Tengu Juurai to take effect.",
    "elemental_burst": " Subjugation: Koukou Sendou Casts down Tengu Juurai: Titanbreaker, dealing AOE Electro DMG. Afterwards, Tengu Juurai: Titanbreaker spreads out into 4 consecutive bouts of Tengu Juurai: Stormcluster, dealing AoE Electro DMG. ________________ ・Tengu Juurai: Titanbreaker and Tengu Juurai: Stormcluster can provide the active character within their AoE with the same ATK Bonus as given by the Elemental Skill, Tengu Stormcall. ・ The ATK Bonuses from various Tengu Juurai will not stack, and their effects and duration will be determined by the last Tengu Juurai to take effect.",
    "passive_talent_1": " Immovable Will While in the Crowfeather Cover State provided by Tengu Stormcall, Aimed Shot charge times are decreased by 60%.",
    "passive_talent_2": " Decorum When Tengu Juurai: Ambush hits opponents, it will restore energy to all party members based on her current amount of Energy Recharge."
  },
  "Sayu": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Viridescent veneer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Yoohoo Art: Fuuin Dash The special technique of the Yoohoo Ninja Arts! Sayu curls up into a rolling Fuufu Windwheel and smashes into opponents at high speed, dealing Anemo DMG. When the duration ends, she unleashes a Fuufuu Whirlwind Kick, dealing AoE Anemo DMG. Press Enters Fuufuu Windwheel state, rolling forward a short distance before using Fuufuu Whirlwind Kick. ________________ Hold Attack: Hold Rolls about in Fuufuu Windwheel State that increases Sayu's resistance to interruption. During that, she can control the roll's direction and can use the skill again to end the state and use a stronger Fuufuu Whirlwind Kick. Hold triggers Elemental Absorption. The maximum skill duration is 10s. The longer she remains in that state, the longer the CD. ________________ Elemental Absorption: If Sayu comes into contact with Hydro/Pyro/Cryo/Electro while in her Whirlwind state, she will deal additional DMG of that type. Elemental Absorption may only occur once per use of this skill. ________________",
    "elemental_burst": " Yoohoo Art: Mujina Flurry The other super special technique of the Yoohoo Ninja Arts! It summons a pair of helping hands for Sayu. Deals Anemo DMG to nearby opponents and heals all nearby party members. The amount of HP restored is based on Sayu's ATK. This skill then summons a Muji-Muji Daruma. ________________ Muji-Muji Daruma At intervals, the Daruma will take an action: ・If all nearby characters' HP is above 70%, it will deal Anemo DMG to a nearby opponent. ・If nearby active characters' HP is 70% or less, it will heal the active character with the lowest HP. If no opponents are nearby, it will heal all active characters nearby. ________________",
    "passive_talent_1": " Someone More Capable When Sayu triggers a Swirl reaction while active, she heals all your characters and nearby allies for 300 HP. She will also heal an additional 1.2 HP for every point of Elemental Mastery she has. This effect can be triggered once every 2s.",
    "passive_talent_2": " No Work Today! The Muji-Muji Daruma created Yoohoo Art: Mujina Flurry gains the following effects: ・When healing a character, it will also heal characters near that healed character for 20% the amount of HP. ・Increases the AoE of its attack against opponents."
  },
  "Sethos": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Wanderer’s Troupe",
      "piece_bonus": "4pc) Increases Charged Attack DMG by 35% if the character uses a Catalyst or a Bow.",
      "description": ""
    },
    "elemental_skill": " Ancient Rite: The Thundering Sands Gathers the might of thunder, dealing AoE Electro DMG and quickly retreating. If this attack triggers Electro-Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or Electro Swirl reactions, Sethos recovers a certain amount of Elemental Energy.",
    "elemental_burst": " Secret Rite: Twilight Shadowpiercer Perform a secret rite, entering the “Twilight Meditation” state, during which Sethos's Normal Attacks will be converted into enemy-piercing Dusk Bolts: Deal Electro DMG to opponents in its path, with DMG increased based on Sethos's Elemental Mastery. Sethos cannot perform Aimed Shots while in this state. DMG dealt by Dusk Bolts is considered Charged Attack DMG. This effect will be canceled when Sethos leaves the field.",
    "passive_talent_1": " Black Kite's Enigma When Aiming, the charging time is decreased by 0.285s based on each point of Sethos's current Elemental Energy. Charging time can be reduced to a minimum of 0.3s through this method and a maximum of 20 Energy can be tallied. If a Shadowpiercing Shot is fired, consume the tallied amount of Elemental Energy; if it is a Charge Level 1 shot, then consume 50% of the tallied amount of Elemental Energy.",
    "passive_talent_2": " The Sand King's Boon Sethos gains the \"Scorching Sandshade\" effect, increasing the DMG dealt by Shadowpiercing Shots by 700% of Sethos's Elemental Mastery. The Scorching Sandshade effect will be canceled when any of the following conditions are met: · 5s after a Shadowpiercing Shot first hits an opponent. · After 4 Shadowpiercing Shots strike opponents. When a Shadowpiercing Shot affected by Scorching Sandshade first hits an opponent, Sethos will regain Scorching Sandshade after 15s.\""
  },
  "Shenhe": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Talent Description Shenhe grants Icy Quill to all party members and deals Cryo DMG. Tap: Shenhe rushes forward with a Talisman Spirit, dealing Cryo DMG along the path. Hold: Commands the Talisman Spirit to deal AoE Cryo DMG. ________________ Icy Quill: When Normal, Charged and Plunging Attacks, Elemental Skills and Bursts deal Cryo DMG to opponents, the DMG dealt increases based on Shenhe's ATK. When 1 Cryo DMG instance strikes multiple opponents, the effect is triggered based on the number of opponents hit. The number of times the effect is triggered is calculated independently for each party member.",
    "elemental_burst": " Talent Description Unleashes the power of the Talisman Spirit, allowing it to roam free in this plane, dealing AoE Cryo DMG. The Talisman Spirit then creates a field that decreases the Cryo RES and Physical RES of opponents within it. It also deals periodic Cryo DMG to opponents within the field.",
    "passive_talent_1": " Talent Description An active character within the field created by Divine Maiden's Deliverance gains 15% Cryo DMG Bonus.",
    "passive_talent_2": " Talent Description After Shenhe uses Spring Spirit Summoning, she will grant all nearby party members the following effects: • Press: Elemental Skill and Elemental Burst DMG increased by 15% for 10s. • Hold: Normal, Charged, and Plunging Attack DMG increased by 15% for 15s."
  },
  "Kuki-Shinobu": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "flower of paradise lost",
      "piece_bonus": "4pc) The equipping character's Bloom, Hyperbloom, and Burgeon reaction DMG are increased by 40%. Additionally, after the equipping character triggers Bloom, Hyperbloom, or Burgeon, they will gain another 25% bonus to the effect mentioned prior. Each stack of this lasts 10s. Max 4 stacks simultaneously. This effect can only be triggered once per second. The character who equips this can still trigger its effects when not on the field.",
      "description": ""
    },
    "elemental_skill": " Sanctifying Ring Creates a Grass Ring of Sanctification at the cost of part of her HP, dealing Electro DMG to nearby opponents. ________________ Grass Ring of Sanctification Follows your current active character around. Deals Electro DMG to nearby opponents every 1.5s and restores HP for active character(s) within the ring's AoE based on Kuki Shinobu's Max HP. The HP consumption from using this skill can only bring her to 20% HP.",
    "elemental_burst": " Gyoei Narukami Kariyama Rite Stabs an evil-excoriating blade into the ground, creating a field that cleanses the area of all that is foul, dealing continuous Electro DMG to opponents within its AoE based on Shinobu's Max HP. If Shinobu's HP is less than or equal to 50% when this skill is used, the field will last longer.",
    "passive_talent_1": " Break Free When Shinobu's HP is not higher than 50%, Her healing Bonus is increased by 15%",
    "passive_talent_2": " Heart's Repose Sanctifying Ring's abilities will be boosted based on Shinobu's Elemental Mastery: ・Healing amount will be increased by 75% of Elemental Mastery. ・DMG dealt is increased by 25% of Elemental Mastery."
  },
  "Sigewinne": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "songs of days past",
      "piece_bonus": "4pc) When the equipping character heals a party member, the Yearning effect will be created for 6s, which records the total amount of healing provided. When the duration expires, when your active party member hits an opponent with a Normal Attack, Charged Attack, Plunging Attack, Elemental Skill, or Elemental Burst, the DMG dealt will be increased by 8% of the total healing amount recorded by the Yearning effect.",
      "description": ""
    },
    "elemental_skill": " Rebound Hydrotherapy Blows a Bolstering Bubblebalm that bounces between nearby opponents, dealing Hydro DMG based on Sigewinne's Max HP. When it bounces, it will restore HP to all nearby party members based on Sigewinne's Max HP, excluding herself. Once the bubble disappears, it will restore HP to Sigewinne based on her Max HP value. When no opponents are present, the Bolstering Bubblebalm will bounce nearby. ________________ Hold Attack: When this skill is held, the Bubblebalm can grow up to two tiers in size, which decreases for every bounce. Each tier increases its DMG and healing by 5%. Big Bubblebalms will imprison each weak enemy it hits, while creating 2 Sourcewater Droplets. Each droplet she collects grants her a Bond of Life worth 10% of her Max HP. When all Bond of Life is cleared, she regains 1 ER for every 2,000 HP worth of the Bond of Life that was cleared. Sigewinne can regain up to 5 Elemental Energy in this way.",
    "elemental_burst": " Super Saturated Syringing Takes out a special Fortress of Meropide-made syringe and assault the area in front with waves of kindness and medicine, dealing AoE Hydro DMG based on Sigewinne's Max HP. In addition, Sigewinne absorbs up to 2 nearby Sourcewater Droplets within a certain range when she uses this skill.",
    "passive_talent_1": " Requires Appropriate Rest Sigewinne grants herself the \"Semi-Strict Bedrest\" effect for 18s after using Rebound Hydrotherapy: Sigewinne gains an 8% Hydro DMG Bonus and 10 stacks of Convalescence. When the Elemental Skills of your nearby off-field party members other than Sigewinne deal DMG, consume 1 stack of Convalescence, and increase the DMG dealt by this instance of Elemental Skill DMG. Every 1,000 Max HP Sigewinne has above 30,000 increases the DMG by 80. The maximum DMG increase for Elemental Skills that can be gained in this way is 2,800.",
    "passive_talent_2": " Detailed Diagnosis, Thorough Treatment When Sigewinne performs healing, the amount healed for this instance is increased based on the total current value of the Bonds of Life on all party members: For each 1,000 HP worth of Bonds of Life, the outgoing healing is increased by 3%. The amount of healing provided can be increased by up to 30% in this way."
  },
  "Sucrose": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " Astable Anemohypostasis Creation - 6308 Creates a small Wind Spirit that deals Anemo DMG to enemies in an AoE, pulling them towards the location of the Wind Spirit before launching them.",
    "elemental_burst": " Forbidden Creation - Isomer 75 / Type II Sucrose hurls an unstable concoction that creates a Large Wind Spirit. While it persists, the Large Wind Spirit will continuously pull and launch nearby enemies, dealing AoE Anemo DMG. ________________ Elemental Absorption: If the Wind Spirit comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional DMG of that type. Elemental Absorption may only occur once per use.",
    "passive_talent_1": " Catalyst Conversion When Sucrose triggers a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s.",
    "passive_talent_2": " Mollis Favonius When Astable Anemohypostasis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases all party members' (excluding Sucrose) Elemental Mastery based on 20% of Sucrose's Elemental Mastery for 8s."
  },
  "Tartaglia": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Nymph’s dream",
      "piece_bonus": "4pc) After Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts hit opponents, 1 stack of Mirrored Nymph will be triggered, lasting 8s. When under the effect of 1, 2, or 3 or more Mirrored Nymph Stacks, ATK will be increased by 7%/16%/25%, and Hydro DMG bonus will be increased by 4%/9%/15%. Mirrored Nymph stacks created by Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts exist independently.",
      "description": ""
    },
    "elemental_skill": " Foul Legacy: Raging Tide Unleashes a set of weaponry made from pure water, dealing Hydro DMG to surrounding opponents and entering Melee Stance. In this Stance, Tartaglia's Normal and Charged Attacks change as follows: ________________ ・Normal Attack: Perform up to 6 consecutive Hydro strikes. ・Charged Attack: Consumes a certain amount of Stamina to unleash a cross slash, dealing Hydro DMG. ・Riptide Slash: Hitting an opponent affected by Riptide with a melee attack unleashes a Riptide Slash that deals AoE Hydro DMG. DMG dealt in this way is considered Elemental Skill SMG, and can only occur once every 1.5s.",
    "elemental_burst": " Havoc: Obliteration Performs different attacks based on what stance Tartaglia is when casting. ________________ ・Ranged Stance: Flash of Havoc: Swiftly fires a Hydro-imbued magic arrow, dealing AoE Hydro DMG and applying the Riptide status. Returns a portion of its Energy Cost after use. ・Melee Stance: Light of Obliteration: Performs a slash with a large AoE, dealing massive Hydro DMG to all surrounding opponents, which triggers Riptide Blast. ・Riptide Blast: When the obliterating waters hit an opponent affected by Riptide, it clears their Riptide statis and triggers a Hydro Explosion that deals Aoe Hydro DMG. DMG dealt this way is considered Elemental Burst DMG.",
    "passive_talent_1": " Never Ending Extends Riptide duration by 8s.",
    "passive_talent_2": " Master of Weaponry Increases your own party members' Normal Attack Level by 1. Passive talent 3: Sword of Torrents When Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, or if his Normal and Charged Attacks do CRIT DMG, they will apply the Riptide status effect on the hit enemy."
  },
  "Thoma": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Flower of Paradise Lost",
      "piece_bonus": "4pc) The equipping character's Bloom, Hyperbloom, and Burgeon reaction DMG are increased by 40%. Additionally, after the equipping character triggers Bloom, Hyperbloom, or Burgeon, they will gain another 25% bonus to the effect mentioned prior. Each stack of this lasts 10s. Max 4 stacks simultaneously. This effect can only be triggered once per second. The character who equips this can still trigger its effects when not on the field.",
      "description": ""
    },
    "elemental_skill": " Blazing Blessing Thoma vaults forward with his polearm and delivers a flame-filled flying kick that deals AoE Pyro DMG, while also summoning a Blazing Barrier. At the moment of casting, Thoma's Elemental Skill applies Pyro to himself. The DMG Absorption of the Blazing Barrier scales off of Thoma's Max HP. ________________ Blazing Barrier ・Absorbs Pyro DMG 250% more effectively. ・When a new Blazing Barrier is obtained, the remaining DMG Absorption of an existing Blazing Barrier will stack and its duration will be refreshed. The maximum DMG Absorption of the Blazing Barrier will not exceed a certain percentage of Thoma's Max HP.",
    "elemental_burst": " Crimson Ooyoroi Thoma spins his polearm, slicing at his foes with roaring flames that deal AoE Pyro DMG and weave themselves into a Scorching Ooyoroi. ________________ Scorching Ooyoroi While Scorching Ooyoroi is in effect, the active character's Normal Attacks will trigger Fiery Collapse, dealing AoE Pyro DMG and summoning a Blazing Barrier. Fiery Collapse can be triggered once every 1s. Except for the amount of DMG they can absorb, the Blazing Barriers created in this way are identical to those created by Thoma's Elemental Skill, Blazing Blessing. If Thoma falls, the effects of Scorching Ooyoroi will be cleared.",
    "passive_talent_1": " Imbricated Armor When your current active character obtains or refreshes a Blazing Barrier, this character's Shield Strength will increase by 5% for 6s. This effect can be triggered once every 0.35 seconds. Max 5 stacks.",
    "passive_talent_2": " Flaming Assault DMG dealt by Crimson Ooyoroi's Fiery Collapse is increased by 2.2% of Thoma's Max HP."
  },
  "Tighnari": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Deepwood memories",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": " Vijnana-Phala Mine Tighnari throws a Vijnana Stormheart ahead of him that deals AoE Dendro Damage and creates a Vijnana-Khanda Field, which summons strange illusions to taunt enemies and draw their fire. Additionally, Tighnari gains a Vijnana Suffusion effect, which will decrease the next Wreath Arrow's charging time by 2.4 seconds. This effect will dissipate once the skill duration ends or after Tighnari has fired 3 Wreath Arrows. ________________ Vijnana-Khanda Field Creates mysterious illusions that taunt opponents. ・Decreases charging time for the next three Wreath Arrows.",
    "elemental_burst": " Fashioner's Tanglevine Shaft Combines the power of all seeds to fire 6 Tanglevine Shafts that can track opponents and deal Dendro DMG. After they hit, the Tanglevine Shafts will create a secondary wave of Tanglevine Shafts that can also track opponents and deal Dendro DMG on hit.",
    "passive_talent_1": " Keen Sight After Tighnari fires a Wreath Arrow, his Elemental Mastery is increased by 50 for 4s.",
    "passive_talent_2": " Scholarly Blade For every point of Elemental Mastery Tighnari possesses, his Charged Attack and Fashioner's Tanglevine Shaft DMG are increased by 0.06%. The maximum DMG Bonus obtainable this way is 60%."
  },
  "Traveller (Anemo)": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": " Palm Vortex Grasping the wind's might, you form a vortex of vacuum in your palm, causing continuous Anemo DMG to enemies in front of you. The vacuum vortex explodes when the skill duration ends, causing a greater amount of Anemo DMG over a larger area. ________________ Hold Attack: DMG and AoE will gradually increase. ________________ Elemental Absorption: If the vortex comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional DMG of that type. Elemental Absorption may only occur once per use.",
    "elemental_burst": " Gust Surge Guiding the path of the wind currents, you summon a forward-moving tornado that pulls objects and opponents towards itself, dealing continuous Anemo DMG. ________________ Elemental Absorption: If the tornado comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional DMG of that type. Elemental Absorption may only occur once per use.",
    "passive_talent_1": " Slitting Wind The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as Anemo DMG to all opponents in its path.",
    "passive_talent_2": " Second Wind Palm Vortex kills regenerate 2% HP for 5s. This effect can only occur once every 5s."
  },
  "Traveller (Geo)": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Nighttime whispers of the echoing woods",
      "piece_bonus": "4pc) After using an Elemental Skill, gain a 20% Geo DMG Bonus for 10s. While under a shield granted by the Crystallize reaction, the above effect will be increased by 150%, and this additional increase disappears 1s after that shield is lost.",
      "description": ""
    },
    "elemental_skill": " Starfell Sword You disgorge a meteorite from the depths of the earth, dealing AoE Geo DMG. The meteorite is considered a Geo Construct, and can be climbed or used to block attacks. ________________ Hold Attack: This skill's positioning may be adjusted.",
    "elemental_burst": " Wake of Earth Energizing the Geo elements deep underground, you set off expanding shockwaves. Launches surrounding enemies back and deals AoE Geo DMG. A stone wall is erected at the edges of the shockwave. The stone wall is considered a Geo Construct, and may be used to block attacks.",
    "passive_talent_1": " Shattered Darkrock Reduces Starfell Sword's CD by 2s.",
    "passive_talent_2": " Frenzied Rockslide The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as AoE Geo DMG."
  },
  "Traveller (Electro)": {
    "talent_priority": [
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "noblesse oblige",
      "piece_bonus": "4pc) Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack.",
      "description": ""
    },
    "elemental_skill": " Talent Description Unleashes three swift thunder shadows that deal Electro DMG to opponents and leave an Abundance Amulet behind after hitting an opponent. 2 Abundance Amulets can be created initially. Using this skill will reset any Abundance Amulets that were generated. ________________ Abundance Amulets When a character is near an Abundance Amulet, they will absorb it and obtain the following effects: ・Restores Elemental Energy ・Increases Energy Recharge during the Abundance Amulet's duration.",
    "elemental_burst": " Talent Description You call the protection of lightning, knocking nearby opponents back and dealing Electro DMG to them. ________________ Lightning Shroud When your character's Normal or Charged Attacks hit opponents, they will call Falling Thunder forth, dealing Electro DMG. When Falling Thunder hits opponents, it will regenerate Energy for that character. One instance of Falling Thunder can be generated every 0.5s.",
    "passive_talent_1": " Talent Description When another nearby character in the party obtains an Abundance Amulet created by Lightning Blade, Lightning Blade's CD is decreased by 1.5s.",
    "passive_talent_2": " Talent Description Increases the Energy Recharge effect granted by Lightning Blade's Abundance Amulet by 10% of the Traveler's Energy Recharge."
  },
  "Traveller (Dendro)": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Deepwood memories",
      "piece_bonus": "4pc) After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field.",
      "description": ""
    },
    "elemental_skill": " Razorgrass Blade With a flourish of your blade, you unleash a spray of razor-sharp leaves that go before you and deal Dendro DMG.",
    "elemental_burst": " Surgent Manifestation Calling upon the might of the flora all around you, you create a Lea Lotus Lamp. This Lamp will deal continuous Dendro DMG to opponents within its AoE.",
    "passive_talent_1": " Verdant Overgrowth Lea Lotus Lamp will obtain one level of Overflowing Lotuslight every second it is on the field, increasing the Elemental Mastery of active character(s) within its AoE by 6. Overflowing Lotuslight has a maximum of 10 stacks.",
    "passive_talent_2": " Verdant Luxury Every point of Elemental Mastery the Traveler possesses increases the DMG dealt by Razorgrass Blade by 0.15% and the DMG dealt by Surgent Manifestation by 0.1%."
  },
  "Traveller (Hydro)": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Nymph’s dream",
      "piece_bonus": "2pc) hydro DMG +15%  golden troupe",
      "description": ""
    },
    "elemental_skill": " Talent Description Unleashes a torent that can cleanse the world Press Sends a Torrent Surge forward that will deal Hydro DMG to opponents it comes into contact with. ________________ Hold Attack: Enter Aiming Mode and constantly fire off Dewdrops in the direction in whcih you are aiming, dealing Hydro DMG to opponents they hit. When the Skill ends, it will send a Torrent Surge forward that will deal Hydro DMG to opponents it comes into contact with.",
    "elemental_burst": " Talent Description Unleashes a slow-moving floating bubble that deals continuous Hydro DMG to nearby opponents.",
    "passive_talent_1": " Talent Description After the Dewdrop fired by Hold Mode of the Aquacrest Saber hits an opponent, a Sourcewater Droplet will be generated near the Traveler. If the Traveler picks it up, they will restore 7% HP. 1 Droplet can be created this way every second, and each use of Aquacrest Saber can create 4 Droplets at most.",
    "passive_talent_2": " Talent Description If HP has been consumed via Suffusion while using the Hold Mode Aquacrest Saber, the Torrent Surge at the skill's end will deal Bonus DMG equal to 45% of the total HP the Traveler has consumed in this skill via Suffusion. The maximum DMG Bonus that can be gained this way is 5,000."
  },
  "Traveller (Pyro)": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "scroll of the hero of cinder city",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": " Flowfire Blade Wields a searing flame that can incinerate the very earth. Has different effects when Tapped or Held. ________________ Tap Call forth flames in a raging blaze. When used, the Traveler gains 42 Nightsoul points and enters the Nightsoul's Blessing state, summoning a Blazing Threshold that follows the current active character. When the Blazing Threshold gets close to opponents, it will deal Nightsoul-aligned Pyro DMG to nearby opponents at intervals. ________________ Hold Unleash fire in a composed manner, dealing Nightsoul-aligned AoE Pyro DMG to nearby opponents. When used, the Traveler gains 42 Nightsoul points and enters the Nightsoul's Blessing state, summoning a Scorching Threshold that follows the current active character. When the current active character within a Scorching Threshold deals DMG to opponents, the Threshold will launch a Coordinated Attack that deals Nightsoul-aligned Pyro DMG based on the Traveler's ATK. This effect can occur once every 3s. ________________ Nightsoul's Blessing: Traveler Continuously consumes Nightsoul points. The Traveler's Nightsoul's Blessing state lasts 12s at maximum, and when their Nightsoul points are exhausted, or if the skill is used again, this state will end. Blazing and Scorching Thresholds will disappear once the Traveler's Nightsoul's Blessing state ends, and only 1 Blazing or Scorching Threshold summoned by the Traveler themselves can exist at any one time.",
    "elemental_burst": " Plains Scorcher Condense the flames into a mark, dealing Nightsoul-aligned AoE Pyro DMG to opponents up ahead. Within the next 4s, the Traveler restores 7 Nightsoul points per second.",
    "passive_talent_1": " True Flame of Incineration When the Traveler has over 20 Nightsoul points, the attack AoE of the Blazing and Scorching Thresholds from the Elemental Skill Flowfire Blade after they hit opponents is increased.",
    "passive_talent_2": " Embers Unspent After the current active character inside a Blazing Threshold or Scorching Threshold triggers Burning, Vaporize, Melt, Overloaded, Burgeon, a Pyro Swirl or a Pyro Crystallize reaction, the Traveler will regain 5 Energy. This can occur once every 12s. Additionally, when a nearby party member triggers a Nightsoul Burst, the Traveler will regain 4 Energy."
  },
  "Venti": {
    "talent_priority": [
      "Elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": " Skyward Sonnet Hold Attack: Summons an even larger Wind Domain with Venti as the epicenter, dealing AoE Anemo DMG and launching affected enemies into the air. After unleashing the Hold version of this ability, Venti rides the wind into the air. Enemies hit by Skyward Sonnet will fall to the ground slowly. ________________ Tap Summons a Wind Domain at the enemy's location, dealing AoE Anemo DMG and launching enemies into the air.",
    "elemental_burst": " Wind's Grand Ode Fires off an arrow made of countless coalesced winds, creating a huge Stormeye that sucks in objects and enemies along its path, dealing continuous Anemo DMG. ________________ Elemental Absorption: If the Stormeye comes into contact with Hydro/Pyro/Cryo/Electro elements, it will deal additional DMG of that type. Elemental Absorption may only occur once per use. Venti's Elemental Burst, Wind's Grand Ode, creates a vortex that sucks in all surrounding enemies within range. The vortex deals massive damage and absorbs Cryo, Hydro, Electro, and Pyro Elements, dealing additional damage to enemies trapped inside. Enemies with elemental auras, like slimes, will immediately imbue their element into the vortex and will be immune to the additional elemental damage. Triggering elemental reactions in the vortex is the best way to deal with pesky elemental auras.",
    "passive_talent_1": " Embrace of Winds Holding Skyward Sonnet creates and upcurrent that lasts for 20s.",
    "passive_talent_2": " Stormeye Regenerates 15 Energy for Venti after the effects of Wind's Grand Ode end. If an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element in the party."
  },
  "Varesa": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Long Night's Oath",
      "piece_bonus": "4pc",
      "description": "Running 4-pc Long Night's Oath is Varesa's best bet for damage as it stacks her plunging damage by up to 100% more if all 5 stacks are triggered."
    },
    "elemental_skill":"Activating Varesa's Elemental Skill causes her to enter a special combat state that does a few things for her. Normal Attacks Lead to Plunge Opportunities Instead of having to use Plunge Attacks, Varesa can just tap the Normal Attack button and gain the same plunge opportunity as with her normal Charged Attack. This effectively adds more convenience and movement to Varesa's kit. Increases Attack Speed In this state, Varesa's attack speed is increased, allowing her to output more damage quickly. On its own, this does not do much for Varesa on the ground, but since she gets raised into the air with her Normal Attacks in this state, this attack speed buff increases her Plunging Attack frequency and DPS.",
    "elemental_burst":"Leaps into the air before using the momentum of the drop to unleash a powerful flying kick, dealing Nightsoul-aligned AoE Electro DMG to opponents  just like those heroes of justice in woven scrolls for kids! After using this Skill, Varesa's Nightsoul points will be restored to maximum and she will enter the Fiery Passion state. Increases Varesa's interruption resistance. While affected by Apex Drive, Varesa can ignore her Elemental Burst CD and consume less Energy to use her special Elemental Burst, Guardian Vent: Volcano Kablam: This causes her to use the especially powerful Plunging Attack, Thunderous Tornado Eruption, which deals Nightsoul-aligned AoE Electro DMG upon landing before causing her to exit Apex Drive. This DMG is considered Plunging Attack DMG. Varesa will exit Apex Drive after using her Elemental Skill. In the Fiery Passion state, Varesa's Elemental Burst will deal a greater amount of Nightsoul-aligned AoE Electro DMG.",
    "passive_talent_1":"Tag-Team Triple Jump! After using the Elemental Skill Riding the Night-Rainbow, Varesa gains Rainbow Crash for 5s. During this time, when Varesa uses a Plunging Attack, the shockwave DMG dealt when she hits the ground is increased by 50% of her ATK. If Varesa is in the Fiery Passion state, this ground impact DMG is increased by 180% of her ATK instead. The Rainbow Crash effect will be canceled once a ground impact hits an opponent, or when its duration expires.",
    "passive_talent_2":"When a nearby party member triggers a Nightsoul Burst, Varesa's ATK increases by 35% for 12s. Max 2 stacks. Each stack's duration is counted independently."},
  "Wanderer": {
    "talent_priority": [
      "Normal attack and elemental skill",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Desert Pavillion Chronicle",
      "piece_bonus": "4pc) When Charged Attacks hit opponents, the equipping character's Normal Attack speed will increase by 10% while Normal, Charged, and Plunging Attack DMG will increase by 40% for 15s",
      "description": ""
    },
    "elemental_skill": " Hanega: Song of the Wind Deals Anemo DMG momentarily after which the Wanderer hovers midair. He then enters Windfavored state, converting his normal and charged attacks to Kuugo: Fushoudan and Toufukai, respectively. Upon using the Wanderer's Elemental Skill, he will momentarily deal Anemo damage before hovering above ground. He can maneuver up, sidewards, or forward, but he cannot descend. Once mid-air the Wanderer also enters the Windfavored state and will consequently become unable to do plunging attacks",
    "elemental_burst": " Kyougen: Five Ceremonial Plays Compresses a vacuum of Anemo ball that deals multiple instances of Anemo upon contact. If Wanderer uses his burst while in the Windfavored state, Windfavored will end immediately.",
    "passive_talent_1": " Jade-Claimed Flower Hanega: Song of the Wind will gain different buffs depending on the element it Swirled. This buff can occur two times simultaneously. The Wanderer can absorb two elements at once during his Elemental Skill if it comes in contact with Hydro, Pyro, Cryo, or Electro. These elements will give Scaramouche buff effects depending on the contact element. Element Effect Hydro Hydro Kuugoryoku Point cap increases by 20. Cryo Cryo CRIT Rate increases by 20%. Pyro Pyro ATK increases by 30%. Electro Electro When Normal and Charged Attacks hit an opponent, 0.8 Energy will be restored. Energy can be restored this way once every 0.2s.",
    "passive_talent_2": " Gales of Reverie During his Windfavored state, the Wanderer has a chance to gaining another buff effect."
  },
  "Wriothesley": {
    "talent_priority": [
      "normal attack",
      "elemental skill",
      "elemental burst"
    ],
    "best_artifact_set": {
      "name": "Marechaussee Hunter",
      "piece_bonus": "4pc) When current HP increases or decreases, CRIT Rate will be increased by 12% for 5s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " cefang Rush Adjusting his breathing, rhythm, and pace, Wriothesley sprints forward a short distance, entering the Chilling Penalty state and unleashing more powerful attacks than before. ________________ Chilling Penalty • Increases Wriothesley's interruption resistance. • When his HP is above 50%, it will enhance the Repelling Fists of Normal Attack: Forceful Fists of Frost and increase its DMG. When such an attack hits, it will consume a fixed amount of Wriothesley's HP. HP can be lost this way once every 0.1s. This effect will be canceled should Wriothesley leave the field.",
    "elemental_burst": "Darkgold WolfbiteActivating his boxing gloves, Wriothesley strikes out with an icy straight, then uses Icicle Impact to cause multiple instances of AoE Cryo DMG in a frontal area. ________________ Arkhe: Ousia After Icicle Impact ends, a Surging Blade will descend upon the opponent's position, dealing Ousia-aligned Cryo DMG.",
    "passive_talent_1": " There Shall Be a Plea for Justice When Wriothesley's HP is less than 60%, he will obtain a Gracious Rebuke. The next Charged Attack of his Normal Attack: Forceful Fists of Frost will be enhanced to become Rebuke: Vaulting Fist. It will not consume Stamina, will deal 50% increased DMG, and after hitting will restore HP for Wriothesley equal to 30% of his Max HP. You can gain a Gracious Rebuke this way once every 5s.",
    "passive_talent_2": " There Shall Be a Reckoning for Sin When Wriothesley's current HP increases or decreases, if he is in the Chilling Penalty state conferred by Icefang Rush, Chilling Penalty will gain one stack of Prosecution Edict. Max 5 stacks. Each stack will increase Wriothesley's ATK by 6%."
  },
  "Xiangling": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Emblem of Severed Fate",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": "Once Xiangling reaches Ascension 4, Gouba will leave a Chili Pepper after disappearing. Picking up the Chili Pepper will increase the character's attack damage by 10%!",
    "elemental_burst": " Pyronado Displaying her mastery over both fire and polearms, Xiangling sends a Pyronado whirling around her. The Pyronado will move with your character for so long as the ability persists, dealing Pyro DMG to all enemies in its path. Xiangling's Elemental Burst, the Pyronado, launches a fire ring that spins around her for a number of seconds. This is very effective against enemy mobs, and a great way to set up quick Elemental Reactions like Melt, Vaporize, and Overload. This also sets up Xiangling as an excellent off-field Pyro applicator.",
    "passive_talent_1": " Crossfire Increases the flame range of Guoba by 20%.",
    "passive_talent_2": " Beware, It's Super Hot! When Guoba Attack's effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s."
  },
  "Xianyun": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Viridescent Veneer",
      "piece_bonus": "4pc)  Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": " White Clouds at Dawn Xianyun enters the Cloud Transmogrification state, in which she will not take Fall DMG, and uses Skyladder once. In this state, her Plunging Atack will be converted into Driftcloud Wave instead, which deals AoE Anemo DMG and ends the Cloud Transmogrification state. This DMG is considered Plunging Attack DMG. Each use of Skyladder while in this state increases the DMG and AoE of the next Driftcloud Wave used. ________________ Skyladder: Can be used while in mid-air. Xianyun leaps forward dealing Anemo DMG to targets along her path. During each Cloud Transmogrification state Xianyun enters, Skyladder may be used up to 3 times and only 1 instance of Skyladder DMG can be dealt to any one opponent. If Skyladder is not used again in a short period, the Cloud Transmogrification state will be canceled. If Xianyun does not use Driftcloud Wave while in this state, the next CD of White Clouds at Dawn will be decreased by 3s. Stars Gather at Dusk Brings forth a scared breeze that deals AoE Anemo DMG and heals all nearby characters based on Xinayun's ATK. It will summon the “Starwicker” mechanism. ________________ Starwicker: • Continuously follows the active character and periodically heals all nearby party members based on Xianyun's ATK. • Starts with 8 stacks of Adeptal Assistance. While Adeptal Assistance is active, nearby active characters in the party will have their jump height increased. • When the active character completes a Plunging Attack, Starwicjer will consume 1 stack of Adeptal Assistance and deal AoE Anemo DMG.",
    "elemental_burst": "Xianyun's core kit for support is her Elemental Burst, where she unleashes her greatest invention to date: the Skywicker. During Skywicker's duration on the field, it will follow and heal your active character, and enable active characters to increase their jump height, allowing them to make use of their Plunging Attacks!",
    "passive_talent_1": " Galefeather Pursuit Each opponent hit by Driftcloud Waves from White Clouds at Dawn will grant all nearby party members 1 stack of Storm Pinion for 20s. Max 4 stacks. These will cause the characters' Plunging Attack CRIT Rate to increase by 4%/6%/8%/10% respectively. Each Storm Pinion created by hitting an opponent has an independent duration. This means that Xianyun's healing and buffing scales with ATK, so you should equip Xianyun with artifacts and weapons that has a high number of ATK.",
    "passive_talent_2": " Consider, the Adeptus in Her Realm When the Starwicker created by Stars Gather at Dusk has Adeptal Assistance stacks, nearby active characters' Plunging Attack shockwave DMG will be increased by 180% of Xianyun's ATK. The maximum DMG increase that can be achieved this way is 9,000. Each Plunging Attack shockwave DMG instance can only apply this increased DMG effect to a single opponent. Each character can trigger this effect once every 0.4s."
  },
  "Xiao": {
    "talent_priority": [
      "Normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Vermillion Hereafter",
      "piece_bonus": "4pc) After using an Elemental Burst, this character will gain the Nascent Light effect, increasing their ATK by 8% for 16s. When the character's HP decreases, their ATK will further increase by 10%. This further increase can occur this way a maximum of 4 times. This effect can be triggered once every 0.8s. Nascent Light will be dispelled when the character leaves the field. If an Elemental Burst is used again during the duration of Nascent Light, the original Nascent Light will be dispelled.",
      "description": ""
    },
    "elemental_skill": " Lemniscatic Wind Cycling Xiao lunges forward, dealing Anemo DMG to opponents in his path. Can be used in midair. Starts with 2 charges.",
    "elemental_burst": " Bane of All Evil Yaksha's Mask: • Greatly increases Xiao's jumping ability. • Increases Xiao's attack AoE and DMG. • Xiao's attack DMG is converted to Anemo DMG, which cannot be overridden by any other elemental infusion. In this state, Xiao will continuously lose HP. The effects of this skill end when Xiao leaves the field. Xiao's Elemental Burst, Bane of All Evil, greatly boosts his Attack damage, imbues his Normal Attacks with Anemo, and drastically increases his jump height about four times allowing for easily repeatable Plunge Attacks at the cost of HP over time.",
    "passive_talent_1": " Conqueror of Evil: Tamer of Demons While under the effects of Bane of All Evil, all DMG increases by a further 5% for every 3s the ability persists. The maximum DMG Bonus is 25%.",
    "passive_talent_2": " Dissolution Eon: Heaven Fall Using Lemniscatic Wind Cycling increases the DMG of subsequent uses of Lemniscatic Wind Cycling by 15%. This effect lasts for 7s, and has a maximum of 3 stacks. Gaining a new stack refreshes the effect's duration."
  },
  "Xilonen": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "scroll of the hero of cinder city",
      "piece_bonus": "4pc) After the equipping character triggers a reaction, all nearby party members gain a 12% Elemental DMG Bonus for the involved Elemental Types for 15s. If the equipping character is in the Nightsoul's Blessing state when triggering this effect, all party members gain an additional 28% Elemental DMG bonus for the Elemental Types involved in the reaction for 20s.",
      "description": ""
    },
    "elemental_skill": " Yohual's Scratch Xilonen switches to high-speed combat blading gear and rushes forward a certain distance before dealing Nightsoul-aligned Geo DMG based on her DEF. After using this, Xilonen will gain 45 Nightsoul points and enter the Nightsoul's Blessing state. In this state, she will shift to the Blade Roller mode. Source Samples Xilonen has 3 Samplers with her that can generate different Soundscapes based on her other party members' Elemental Types, decreasing nearby opponents' corresponding Elemental RES while active. The initial recorded Source Sample within each Sampler will be Geo, and for each party member who is Pyro/Hydro/Cryo/Electro, 1 Geo Sample will change to that corresponding Element. While Xilonen is in the Nightsoul's Blessing state, the Geo Source Sample she carries will always be active. After unlocking her Passive Talent, \"Netotiliztli's Echoes,\" Xilonen can trigger said Passive Talent's effects to regenerate Nightsoul points for herself. When her Nightsoul points hit the maximum, she will consume all her Nightsoul points and activate the 3 Source Samples she has on hand for 15s. When the Source Samples are active, nearby opponents' corresponding Elemental RES will decrease. Source Sample effects of the same Elemental Type cannot stack. Xilonen can trigger these effects even when off-field. Nightsoul's Blessing: Xilonen Continuously consume Nightsoul points. When these points are depleted or if used again, this Nightsoul's Blessing state will end. This state has the following traits: ·Switches to the Blade Roller mode, increasing Xilonen's Movement SPD and climbing speed, and she can perform high-speed leaps in Ocelot Form while climbing. ·Xilonen's Nightsoul's Blessing has the following restrictions: When in this state, Xilonen's Nightsoul points have a 9s time limit. After this limit passes, her Nightsoul points will immediately expire. ________________ After Xilonen's Nightsoul points have expired while she is in the Nightsoul's Blessing state, she will no longer be able to generate Nightsoul points via the Passive Talent \"Netotiliztli's Echoes.\" If there are more than 2 different Elements in Xilonen's team, then her sampler will change two of the gems to the other corresponding elements, and empowers her Elemental Skill. Xilonen can instead hit opponents with her Normal Attacks during her Elemental Skill and gain Nightsoul Points, upon reaching a full Nightsoul bar, the samplers will activated and shred down the Elemental RES of opponents.",
    "elemental_burst": " Ocelotlicue Point! Xilonen deals Nightsoul-aligned AoE Geo DMG based on Xilonen's DEF. Additionally, she will trigger the following effects based on her different Source Samples: ·If she has at least 2 Source Samples that have had their Elemental Types changed, Xilonen will play an Ebullient rhythm, healing nearby active characters at intervals based on her DEF. ·If she has fewer than 2 Source Samples that have had their Elemental Types changed, Xilonen will start up an Ardent rhythm, which will play two additional beats that deal Nightsoul-aligned AoE Geo DMG based on her DEF.",
    "passive_talent_1": " Netotiliztli's Echoes While in the Nightsoul's Blessing state: ·If Xilonen has at least 2 Source Samples that have had their Elemental Types changed, she gains 35 Nightsoul points when her Normal or Plunging Attacks hit opponents. Can be triggered once every 0.1s. ·If Xilonen has fewer than 2 Source Samples that have had their Elemental Types changed, her Normal and Plunging Attacks deal 30% increased DMG.",
    "passive_talent_2": " Portable Armored Sheath While in the Nightsoul's Blessing state, when Xilonen's Nightsoul points reach the maximum, she will trigger an effect equal to that of her Nightsoul Burst. This effect can be triggered once every 14s. Additionally, when nearby party members trigger a Nightsoul Burst, Xilonen's DEF is increased by 20% for 15s."
  },
  "Xingqiu": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": " Guhua Sword: Fatal Rainscreen Xingqiu performs twin strikes with his swords, dealing Hydro DMG. At the same time, this ability creates the maximum number of Rain Swords, which will orbit your active character. ________________ The Rain Swords have the following properties: ・When a character takes DMG, the Rain Sword will shatter, reducing the amount of DMG taken. ・Increases the character's resistance to interruption. 20% of Xingqiu's Hydro DMG Bonus will be converted to additional DMG Reduction for the Rain Sword. The maximum amount of additional DMG Reduction that can be gained this way is 24%. The initial maximum number of Rain Swords is 3. Using this ability applies the Wet status onto the character.",
    "elemental_burst": " Guhua Sword: Raincutter Initiate Rainbow Bladework and fight using an illusory sword rain, while creating the maximum number of Rain Swords. ________________ Rainbow Bladework ・Your active character's Normal Attacks will trigger consecutive sword rain attacks, dealing Hydro DMG. ・Rain Swords will remain at the maximum number throughout the ability's duration. These effects carry over to other characters. Xingqiu's Elemental Burst, Raincutter, rains down multiple hits of Hydro DMG to the enemy, and procs whenever you use Normal Attacks with your active character. These swords individually apply Hydro to the enemy, which makes it a great tool to set up reliable reactions for your teammates. Pairing Xingqiu's Elemental Burst with Pyro characters like Diluc, Klee or Hu Tao is best to set up rapid Vaporize reactions. Likewise, pairing Xingqiu with Cryo characters like Ayaka or Chongyun can set up a Freeze party composition to lock down the battlefield.",
    "passive_talent_1": " Hydropathic When a Rain Sword is shattered or when its duration expires, it regenerates the current character's HP based on 6% of Xingqiu's Max HP.",
    "passive_talent_2": " Blades Amidst Raindrops Xingqiu gains 20% Hydro DMG Bonus."
  },
  "Xinyan": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "emblem of severed fate",
      "piece_bonus": "4pc) Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way.",
      "description": ""
    },
    "elemental_skill": " Sweeping Ferver Xinyan deals Pyro DMG on nearby enemies, forming a shield made out of her audience's passion. The shield's DMG Absorption scales based on Xinyan's DEF and on the number of enemies hit.",
    "elemental_burst": " Riff Revolution Xinyan launches nearby enemies and deals Physical DMG. The sheer intensity of the atmosphere will cause explosions that deal Pyro DMG to nearby enemies. Xinyan's Elemental Burst is a brief Pyro damage over time blast, with an initial Physical DMG burst that launches enemies. This Pyro Blast will last for a brief amount of time, and is also great for taking down Cryo shields.",
    "passive_talent_1": " The Show Goes On, Even Without An Audience... Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding. ・Shield Level 2: Lead-In requirement reduced to 1 enemy hit. ・Shield Level 3: Rave requirement reduced to 2 enemies hit or more.",
    "passive_talent_2": " ...Now That's Rock 'N' Roll! Characters shielded by Sweeping Fervor deals 15% increased Physical DMG."
  },
  "Yae-Miko": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Golden Troupe",
      "piece_bonus": "4pc) Increases Elemental Skill DMG by 25%. Additionally when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field",
      "description": ""
    },
    "elemental_skill": " Yakan Evocation: Sesshou Sakura To Yae, such dull tasks as can be accomplished by driving spirits out need not be done personally. Moves swiftly, leaving a Sesshou Sakura behind. ________________ Sesshou Sakura ・Periodically strikes one nearby opponent with lightning, dealing Electro DMG. ・When there are other Sesshou Sakura nearby, their level will increase, boosting the DMG dealt by these lightning strikes. ・This skill has three charges. A maximum of 3 Sesshou Sakura can exist simultaneously. The initial level of each Sesshou Sakura is 1, and the initial highest level each sakura can reach is 3. If a new Sesshou Sakura is created too close to an existing one, the existing one will be destroyed.",
    "elemental_burst": " Great Secret Art: Tenko Kenshin Legends of \"kitsunetsuki,\" or the manifestation of a kitsune's might, are common in Inazuma's folktales. One that particularly captures the imagination is that of the Sky Kitsune, said to cause lightning to fall down upon the foes of the Grand Narukami Shrine. Summons a lightning strike, dealing AoE Electro DMG. ________________ When she uses this skill, Yae Miko will unseal nearby Sesshou Sakura, destroying their outer forms and transforming them into Tenko Thunderbolts that descend from the skies, dealing AoE Electro DMG. Each Sesshou Sakura destroyed in this way will create one Tenko Thunderbolt.",
    "passive_talent_1": " The Shrine's Sacred Shade When casting her Elemental Burst, Great Secret Art: Tenko Kenshin, each Sesshou Sakura destroyed resets the cooldown for one charge of her Elemental Skill, Yakan Evocation: Sesshou Sakura.",
    "passive_talent_2": " Enlightened Blessing Every point of Elemental Mastery Yae Miko possesses will increase Sesshou Sakura DMG by 0.15%."
  },
  "Yumemizuki Mizuki":{
    "talent_priority":[
      "elemental skill",
      "elemental burst",
      "normal attack"
  ],
  "best_artifact_set": {
      "name": "Viridescent Venerer",
      "piece_bonus": "4pc) Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s.",
      "description": ""
    },
    "elemental_skill": "Weaves memories of lovely dreams, entering a Dreamdrifter state where Yumemizuki Mizuki floats above the ground, and dealing 1 instance of AoE Anemo DMG to nearby opponents. While in the Dreamdrifter state, Yumemizuki Mizuki will continuously drift forward, dealing AoE Anemo DMG to nearby opponents at regular intervals. During this time, Yumemizuki Mizuki can control her direction of drift, and the pick-up distance of Yumemi Style Special Snacks from the Elemental Burst Anraku Secret Spring Therapy will be increased. Increases the Swirl DMG that nearby party members deal based on Yumemizuki Mizuki's Elemental Mastery.Dreamdrifter will end when Mizuki leaves the field or uses her Elemental Skill again.",
    "elemental_burst":"Summons forth countless lovely dreams and nightmares that pull in nearby objects and opponents, dealing AoE Anemo DMG and summoning a Mini Baku. Mini Baku: Follows the current active character. At regular intervals, the Mini Baku will create 1 Yumemi Style Special Snack nearby. After one of your own party members picks up a Special Snack, if their HP is higher than 70%, the Snack will explode and unleash a Munen Shockwave, dealing 1 instance of AoE Anemo DMG to nearby opponents. Otherwise, it will heal the character who picked it up based on Yumemizuki Mizuki's Elemental Mastery. When Yumemizuki Mizuki triggers healing by picking up a Yumemi Style Special Snack, the amount of healing is increased by 100%. If a Snack is not picked up after a period of time, it will explode and release a Munen Shockwave, dealing 1 instance of AoE Anemo DMG to surrounding opponents.",
    "passive_talent_1": "When Yumemizuki Mizuki triggers Swirl while in her Dreamdrifter state, Dreamdrifter's duration increases by 2.5s. This effect can trigger once every 0.3s for a maximum of 2 times per Dreamdrifter state.",
    "passive_talent_2":"While Yumemizuki Mizuki is in the Dreamdrifter state, when other nearby party members hit opponents with Pyro, Hydro, Cryo, or Electro attacks, her Elemental Mastery will increase by 100 for 4s."
  },
  "Yanfei": {
    "talent_priority": [
      "normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Crimson Witch of Flames",
      "piece_bonus": "4pc) Increases Overloaded, Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases 2-Piece Set effects by 50% for 10s. Max 3 stacks.",
      "description": ""
    },
    "elemental_skill": " Signed Edict Summons blistering flames that deal AoE Pyro DMG. Opponents hit by the flames will grant Yanfei the maximum number of Scarlet Seals. Her Elemental Skill, Signed Edict, deals AoE Pyro DMG to surrounding enemies. This also gives her Scarlet Seals for every enemy hit (maximum of 3). This provides you with more attacking options, and allow you to deal more Charged Attacks.",
    "elemental_burst": " Done Deal Triggers a spray of intense flames that rush at nearby opponents, dealing AoE Pyro DMG, granting Yanfei the maximum number of Scarlet Seals, and applying Brilliance to her. ________________ Brilliance: ・Grants Yanfei a Scarlet Seal at fixed intervals. ・Increases the DMG dealt by her Charged Attacks. The effects of Brilliance will end if Yanfei leaves the field or falls in battle.",
    "passive_talent_1": " Proviso When Yanfei consumes Scarlet Seals by using Charged Attack, each Scarlet Seal will increase Yanfei's Pyro DMG Bonus by 5%. This effect lasts for 6s. When a Charged Attack is used against during the effect's duration, it will dispel the previous effect.",
    "passive_talent_2": " Blazing Eye When Yanfei's Charged Attack deals a CRIT Hit to opponents, she will deal an aditional instance of AoE Pyro DMG equal to 80% of her ATK. This DMG counts as Charged Attack DMG."
  },
  "Yaoyao": {
    "talent_priority": [
      "elemental skill",
      "elemental burst",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "deepwood memories",
      "piece_bonus": "4pc) After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field.",
      "description": ""
    },
    "elemental_skill": " Raphanus Sky Cluster Calls upon \"Yuegui: Throwing Mode,\" a special device created by a certain adeptus to help Yaoyao solve her problems. This skill will be used differently in Holding Mode. ________________ Hold Attack: Enters Aiming Mode to adjust the throw direction. ________________ Yuegui: Throwing Mode Throws out White Jade Radishes that will explode upon contact, dealing Dendro DMG and healing characters within a certain AoE based on Yaoyao's Max HP. If a radish fails to hit anyone, the radish will remain where it is and explode upon contact, or once it expires. Yuegui: Throwing Mode will choose its targets. • If all nearby characters have more than 70% HP, it will throw the radish at a nearby enemy. • If nearby characters have 70% or less HP, it will throw at the lowest HP. Otherwise, it will throw at random. Max of 2 instances can exist. Yaoyao's Elemental Skill summons Yuegui, a device that throws White Jade Radishes that heals party members and deals damage to enemies. The White Jade Radish's healing will scale based on Yaoyao's max HP.",
    "elemental_burst": " Moonjade Descent At the enjoinment of a certain adeptus, Yuegui's full potential can be unleashed in an emergency, dealing Dendro DMG to nearby opponents and entering an (in some sense) unsurpassed Adeptal Legacy state. ________________ Adeptal Legacy • White Jade Radishes generated will heal and deal DMG according to this skill. Explosions will heal all nearby party members and deals Dendro DMG to nearby opponents. • Summons \"Yuegui: Jumping Mode\" at intervals until the limit of three has been reached. • Yaoyao's Movement SPD is increased by 15%. • Yaoyao's Dendro RES will be increased. The Adeptal Legacy state will end once Yaoyao is off field, and all remaining Yuegui: Jumping Mode will be cleared once this state ends.",
    "passive_talent_1": " Starscatter While affected by the Adeptal Legacy state caused by Moonjade Descent, Yaoyao will constantly throw White Jade Radishes at nearby opponents when she is sprinting, jumping, or running. She can throw 1 White Jade Radish this way once every 0.6s",
    "passive_talent_2": " In Others' Shoes When White Jade Radishes explode, active characters within their AoE will regain HP every 1s based on 0.8% of Yaoyao's Max HP. This effect lasts 5s"
  },
  "Yelan": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Emblem of Severed Fate",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": " Lingering Lifeline Fires off a Lifeline that allows her to move rapidly, entangling and marking opponents along its path. When this rapid movement ends, the Lifeline will explode, dealing Hydro DMG to the marked opponents based on Yelan's Max HP. ________________ Tap Attack: Moves a certain distance forward swiftly. ________________ Hold Attack: Engages in continuous, swift movement, during which Yelan's resistance to interruption is increased. During this time, Yelan can control this rapid movement and end it by using this Skill again. Additionally, each opponent marked by the \"Lifeline\" when it explodes grants Yelan a 34% chance to reset her \"Breakthrough\" state.",
    "elemental_burst": " Depth-Clarion Dice Deals AoE Hydro Damage and creates an \"Exquisite Throw\" which aids her in battle. ________________ Exquisite Throw This follows the character around and will initiate a coordinated attack under the following circumstances, dealing Hydro DMG based on Yelan's Max HP: ・This can occur once every second when your active character uses a Normal Attack. ・It will initiate a coordinated attack each time Yelan's Lifeline explodes and hits opponents.",
    "passive_talent_1": " Turn Control When the party has 1/2/3/4 Elemental Types, Yelan's Max HP is increased by 6%/12%/18%/30% This passive incentivizes running Yelan in multi-element teams like any of the Dendro variants, as this increases her HP, therefore improving both her damage and survivability in these comps.",
    "passive_talent_2": " Adapt with Ease So long as an Exquisite Throw is in play, your own active character deals 1% more DMG. This increases by a further 3.5% DMG every second. The maximum increase to DMG dealt is 50%. The pre-existing effect will be dispelled if Dephth-Clarion Dice is recast during its duration. When Yelan's Elemental Burst is cast, it not only provides off-field Hydro application, but also directly improves the damage of your On-Field character, making Yelan a great buffer on top of being a good Sub-DPS unit."
  },
  "Yoimiya": {
    "talent_priority": [
      "Normal attack",
      "elemental burst",
      "elemental skill"
    ],
    "best_artifact_set": {
      "name": "Shimenawa’s Reminiscence",
      "piece_bonus": "4pc",
      "description": ""
    },
    "elemental_skill": " Niwabi Fire-Dance Yoimiya waves a sparkler and causes a ring of saltpeter to surround her. ________________ Niwabi Enshou During this time, arrows fired by Yoimiya's Normal Attack will be Blazing Arrows, and their DMG will be increased and converted to Pyro DMG. During this time, Normal Attack: Firework Flare-Up will not generate Kindling Arrows at Charge Level 2. This effect will deactivate when Yoimiya leaves the field.",
    "elemental_burst": " Ryuukin Saxifrage Yoimiya leaps into the air along with her original creation, the \"Ryuukin Saxifrage,\" and fires forth blazing, rockets bursting with surprises that deal AoE Pyro DMG and mark one of the hit opponents with Aurous Blaze. ________________ Aurous Blaze All Normal/Charged/Plunging Attacks, Elemental Skills, and Elemental Bursts by any party member other than Yoimiya that hit an opponent marked by Aurous Blaze will deal AoE Pyro DMG. When an opponent affected by Aurous Blaze is defeated before its duration expires, the effect will pass on to a nearby opponent, who will inherit the remaining duration. One Aurous Blaze can be triggered every 2s. When Yoimiya is down, Aurous Blaze effects will be deactivated.",
    "passive_talent_1": " Tricks of the Trouble-Maker During Niwabi Fire-Dance, shots from Yoimiya's Normal Attack will increase her Pyro DMG Bonus by 2% on hit. This effect lasts for 3s and can have a maximum of 10 stacks.",
    "passive_talent_2": " Summer-Night's Dawn Using Ryuukin Saxifrage causes nearby party members (not including Yoimiya) to gain a 10% ATK increase for 15s. Additionally, a further ATK Bonus will be added on based on the number of \"Tricks of the Trouble-Maker\" stacks when using Ryuukin Saxifrage. Each stack increases this ATK Bonus by 1%."
  },
  "Yun-Jin": {
    "talent_priority": [
      "elemental burst",
      "elemental skill",
      "normal attack"
    ],
    "best_artifact_set": {
      "name": "Husk of Opulent Dreams",
      "piece_bonus": "4pc) DEF +30%",
      "description": ""
    },
    "elemental_skill": " Opening Flourish Ms. Yun may just be acting out fights on stage, but her skills with the spear are real enough to defend against her foes. Tap Flourishes her polearm in a cloud-grasping stance, dealing Geo DMG. ________________ Elemental Skill Hold: Takes up the Opening Flourish stance and charges up, forming a shield. Hold Details: DMG Absorption is based on Yun Jin's Max HP and has 150% effectiveness against all Elemental DMG & Physical DMG. The shield lasts until she finishes unleashing her Elemental Skill. When the skill is released, when its duration ends, or when the shield breaks, Yun Jin will unleash the charged energy as an attack, dealing Geo DMG. Based on the time spent charging, it will either unleash an attack at Charge Level 1 or 2.",
    "elemental_burst": " Cliffbreaker's Banner Deals AoE Geo DMG and grants all nearby party members a Flying Cloud Flag Formation. ________________ Flying Cloud Flag Formation When Normal Attack DMG hits opponents, Bonus DMG is dealt based on Yun Jin's Current DEF. The effects of this skill will be cleared after a set duration or after being triggered a specific number of times. When one Normal Attack hits multiple opponents, the effect is triggered multiple times according to the number of opponents hit. The number of times that the effect is triggered is counted independently for each member of the party with Flying Cloud Flag Formation.",
    "passive_talent_1": "True to OneselfUsing Opening Flourish at the precise moment when Yun Jin is attacked will unleash its Level 2 Charge (Hold) form.",
    "passive_talent_2": " Breaking Conventions The Normal Attack DMG Bonus granted by Flying Cloud Flag Formation is further increased by 2.5%/5%/7.5%/11.5% of Yun Jin's DEF when the party contains characters of 1/2/3/4 Elemental Types, respectively."
  },
  "Zhongli": {
    "talent_priority": [
      ""
    ],
    "best_artifact_set": {
      "name": "Tenacity of the Millelith",
      "piece_bonus": "4pc) 2-PC: HP +20%",
      "description": ""
    },
    "elemental_skill": " Dominus Lapidis Zhongli summons a Stone Stele, dealing AoE Geo DMG. Additionally, the Stone Stele will resonate dealing Geo DMG to surrounding enemies. The Stone Stele is considered a Geo Construct, and can both be climbed and used to block attacks. Only one Stele may exist at any one time. ________________ Hold Attack: Causes nearby Geo energy to explode, causing the following effects: • If their maximum number hasn't been reached, creates a Stone Stele. • Creates a shield of jade. The shield's DMG Absorption scales based on Zhongli's Max HP. Possesses 150% DMG Absorption against all Elemental and Physical DMG. • Characters protected by the Jade Shield will decrease the Elemental RES and Physical RES of opponents in a small AoE by 20%. This effect cannot be stacked. • Deals AoE Geo DMG. ________________ • If there are nearby targets with the Geo element, it will drain a large amount of Geo element from a maximum of 2 such targets. This effect does not cause DMG.",
    "elemental_burst": " Planet Befall Brings a falling meteor down to eart, dealing massive Geo DMG to opponents caught in its AoE and applying the Petrification status to them. ________________ • Petrification: Petrified enemies become immobilized.",
    "passive_talent_1": " Resonant Waves When the Jade Shield takes DMG, it will Fortify: · Fortified characters have 5% increased Shield Strength. Can stack up to 5 times, and lasts until the Jade Shield disappears.",
    "passive_talent_2": " Dominance of Earth Zhongli deals bonus DMG based on his Max HP: • Normal Attack, Charged Attack, and Plunging Attack DMG is increased by 1.39% of Max HP. • Dominus Lapidis' Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP. • Planet Befall's DMG is increased by 33% of Max HP."
  }
}
